zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_TXRX_CNTRL_TX_EXTN_EN_MASK (0x4000U)
#define BLE2_REG_BLE_REG_TXRX_CNTRL_TX_EXTN_EN_SHIFT (14U)
/*! tx_extn_en - Tx Extension Packet, Tx Extension Packet, 0x0: transmit data extension; regular;
 *    non-location BLE transmit packet, 0x1: transmit data extension; transmit extension field for
 *    current packet
 */
#define BLE2_REG_BLE_REG_TXRX_CNTRL_TX_EXTN_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CNTRL_TX_EXTN_EN_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CNTRL_TX_EXTN_EN_MASK)

#define BLE2_REG_BLE_REG_TXRX_CNTRL_WHIT_DIS_MASK (0x8000U)
#define BLE2_REG_BLE_REG_TXRX_CNTRL_WHIT_DIS_SHIFT (15U)
/*! whit_dis - Disable Whitening, 0x0: enable, 0x1: disable */
#define BLE2_REG_BLE_REG_TXRX_CNTRL_WHIT_DIS(x)  (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CNTRL_WHIT_DIS_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CNTRL_WHIT_DIS_MASK)

#define BLE2_REG_BLE_REG_TXRX_CNTRL_RX_LENGTH_MAX_MASK (0xFF0000U)
#define BLE2_REG_BLE_REG_TXRX_CNTRL_RX_LENGTH_MAX_SHIFT (16U)
/*! rx_length_max - Maximum Length for rx_length_err, - For Advt Channel: 37 (if advt_length_ext =
 *    0) or 255 (if advt_length_ext = 1)., - For Data Channel: 31 (if data_length_ext = 0 and
 *    ccm_en_rx = 0) or, 27 (if data_length_ext = 0 and ccm_en_rx = 1) or, 255 (if data_length_ext = 1 and
 *    ccm_en_rx = 0) or, 251 (if data_length_ext = 1 and ccm_en_rx = 1).
 */
#define BLE2_REG_BLE_REG_TXRX_CNTRL_RX_LENGTH_MAX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CNTRL_RX_LENGTH_MAX_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CNTRL_RX_LENGTH_MAX_MASK)

#define BLE2_REG_BLE_REG_TXRX_CNTRL_TX_EXTN_LENGTH_MASK (0x1F000000U)
#define BLE2_REG_BLE_REG_TXRX_CNTRL_TX_EXTN_LENGTH_SHIFT (24U)
/*! tx_extn_length - Tx Extension Length for Tx DFE Packet, Length of extension field to be
 *    transmitted. This value is in the unit of 8 usec time frame and includes the guard period (for
 *    example; spec defined 1~4 usec) between CRC and the antenna switching part of extension., This bit is
 *    valid only when tx_extn_en is set.
 */
#define BLE2_REG_BLE_REG_TXRX_CNTRL_TX_EXTN_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CNTRL_TX_EXTN_LENGTH_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CNTRL_TX_EXTN_LENGTH_MASK)

#define BLE2_REG_BLE_REG_TXRX_CNTRL_RX_RF_AGC_INDEX_MASK (0xE0000000U)
#define BLE2_REG_BLE_REG_TXRX_CNTRL_RX_RF_AGC_INDEX_SHIFT (29U)
/*! rx_rf_agc_index - BRF Rx Power Control Index, BRF Rx power control setting that is programmed
 *    into the BRF_RX_PKT_STATUS[7:5] register., These index bits are taken effect only when RIF
 *    register BTU_RIF_CTL0[1] is set.
 */
#define BLE2_REG_BLE_REG_TXRX_CNTRL_RX_RF_AGC_INDEX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CNTRL_RX_RF_AGC_INDEX_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CNTRL_RX_RF_AGC_INDEX_MASK)
/*! @} */

/*! @name BLE_REG_TXRX_CRC_INIT_VAL - CRC Initialization Value */
/*! @{ */

#define BLE2_REG_BLE_REG_TXRX_CRC_INIT_VAL_CRC_INIT_VALUE_MASK (0xFFFFFFU)
#define BLE2_REG_BLE_REG_TXRX_CRC_INIT_VAL_CRC_INIT_VALUE_SHIFT (0U)
/*! crc_init_value - CRC Initialization Value */
#define BLE2_REG_BLE_REG_TXRX_CRC_INIT_VAL_CRC_INIT_VALUE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CRC_INIT_VAL_CRC_INIT_VALUE_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CRC_INIT_VAL_CRC_INIT_VALUE_MASK)
/*! @} */

/*! @name BLE_REG_TX_ACC_ADDR - Tx Access Address; for Advt and Data Packets */
/*! @{ */

#define BLE2_REG_BLE_REG_TX_ACC_ADDR_TX_ACCESS_ADDRESS_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_TX_ACC_ADDR_TX_ACCESS_ADDRESS_SHIFT (0U)
/*! tx_access_address - Access Address for Tx Packet */
#define BLE2_REG_BLE_REG_TX_ACC_ADDR_TX_ACCESS_ADDRESS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TX_ACC_ADDR_TX_ACCESS_ADDRESS_SHIFT)) & BLE2_REG_BLE_REG_TX_ACC_ADDR_TX_ACCESS_ADDRESS_MASK)
/*! @} */

/*! @name BLE_REG_RX_PKT_STATUS - Rx Packet Status; for Advt and Data Packets */
/*! @{ */

#define BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_PKT_HEADER_MASK (0xFFFFU)
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_PKT_HEADER_SHIFT (0U)
/*! rx_pkt_header - Rx Packet PDU Header */
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_PKT_HEADER(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_PKT_HEADER_SHIFT)) & BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_PKT_HEADER_MASK)

#define BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_EXTN_SUPPL_INFO_MASK (0xFF0000U)
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_EXTN_SUPPL_INFO_SHIFT (16U)
/*! rx_extn_suppl_info - Rx Packet Supplemental Info Byte if available */
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_EXTN_SUPPL_INFO(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_EXTN_SUPPL_INFO_SHIFT)) & BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_EXTN_SUPPL_INFO_MASK)

#define BLE2_REG_BLE_REG_RX_PKT_STATUS_SIMUL_SCAN_CODED_EN_MASK (0x1000000U)
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_SIMUL_SCAN_CODED_EN_SHIFT (24U)
/*! simul_scan_coded_en - Detected Rx Coded Packet Correlation Hit in Simultaneous Scan Mode, 0x0:
 *    Detected BLE 1M Packet Correlation Hit or no correlation at all in Simultaneous, Scan Mode,
 *    0x1: Detected Rx Coded Packet Correlation Hit in Simultaneous Scan Mode
 */
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_SIMUL_SCAN_CODED_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RX_PKT_STATUS_SIMUL_SCAN_CODED_EN_SHIFT)) & BLE2_REG_BLE_REG_RX_PKT_STATUS_SIMUL_SCAN_CODED_EN_MASK)

#define BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_PREAMBLE_MATCH_STS_MASK (0x2000000U)
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_PREAMBLE_MATCH_STS_SHIFT (25U)
/*! rx_preamble_match_sts - Detected Rx Preamble Match during BLE Long Range RX, 0x0: Preamble has
 *    not been detected on most recent RX in long range mode., 0x1: Preamble has been detected on
 *    most recent RX in long range mode. This indication, resets at the start of next RX
 */
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_PREAMBLE_MATCH_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_PREAMBLE_MATCH_STS_SHIFT)) & BLE2_REG_BLE_REG_RX_PKT_STATUS_RX_PREAMBLE_MATCH_STS_MASK)

#define BLE2_REG_BLE_REG_RX_PKT_STATUS_BLE_RX_CODED_PKT_INDIC_STS_MASK (0xC000000U)
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_BLE_RX_CODED_PKT_INDIC_STS_SHIFT (26U)
/*! ble_rx_coded_pkt_indic_sts - Coding Indicator (CI) value received during BLE Long Range RX. This
 *    field indicates the, coding rate of the FEC Block 2 of the LR Rx packet and is valid from
 *    rx_hdr_done_intr till start of next Rx packet, 0x0: FEC Block 2 coded using S=8., 0x1: FEC Block
 *    2 coded using S=2.
 */
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_BLE_RX_CODED_PKT_INDIC_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RX_PKT_STATUS_BLE_RX_CODED_PKT_INDIC_STS_SHIFT)) & BLE2_REG_BLE_REG_RX_PKT_STATUS_BLE_RX_CODED_PKT_INDIC_STS_MASK)

#define BLE2_REG_BLE_REG_RX_PKT_STATUS_ADV_ADDR_NOT_PRESENT_MASK (0x10000000U)
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_ADV_ADDR_NOT_PRESENT_SHIFT (28U)
/*! adv_addr_not_present - This bit indicates if advertiser address is present or absent for each
 *    advertising packet received, 0x0: Advertiser address is present in extended advertising packet
 *    received; or, received packet is a legacy advertising packet, 0x1: Advertiser address is not
 *    present in extended advertising packet received
 */
#define BLE2_REG_BLE_REG_RX_PKT_STATUS_ADV_ADDR_NOT_PRESENT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RX_PKT_STATUS_ADV_ADDR_NOT_PRESENT_SHIFT)) & BLE2_REG_BLE_REG_RX_PKT_STATUS_ADV_ADDR_NOT_PRESENT_MASK)
/*! @} */

/*! @name BLE_REG_RX_CNTRL - Receive Packet Control */
/*! @{ */

#define BLE2_REG_BLE_REG_RX_CNTRL_RX_CNTRL_LENGTH_MAX_MASK (0xFFU)
#define BLE2_REG_BLE_REG_RX_CNTRL_RX_CNTRL_LENGTH_MAX_SHIFT (0U)
/*! rx_cntrl_length_max - Maximum Control PDU Length for rx_length_err, This is the length of max
 *    length Control PDUs., This field is used only if rx_cntrl_length_max_sel is set to 1.
 */
#define BLE2_REG_BLE_REG_RX_CNTRL_RX_CNTRL_LENGTH_MAX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RX_CNTRL_RX_CNTRL_LENGTH_MAX_SHIFT)) & BLE2_REG_BLE_REG_RX_CNTRL_RX_CNTRL_LENGTH_MAX_MASK)

#define BLE2_REG_BLE_REG_RX_CNTRL_RX_CNTRL_LENGTH_MAX_SEL_MASK (0x100U)
#define BLE2_REG_BLE_REG_RX_CNTRL_RX_CNTRL_LENGTH_MAX_SEL_SHIFT (8U)
/*! rx_cntrl_length_max_sel - Select Length Check Register for Control PDUs, 0x0: select
 *    rx_length_max for control PDU length check, 0x1: select rx_cntrl_length_max for control PDU length check
 */
#define BLE2_REG_BLE_REG_RX_CNTRL_RX_CNTRL_LENGTH_MAX_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RX_CNTRL_RX_CNTRL_LENGTH_MAX_SEL_SHIFT)) & BLE2_REG_BLE_REG_RX_CNTRL_RX_CNTRL_LENGTH_MAX_SEL_MASK)

#define BLE2_REG_BLE_REG_RX_CNTRL_REUSE_RX_ADV_ADDR_DONE_INTR_MASK (0x200U)
#define BLE2_REG_BLE_REG_RX_CNTRL_REUSE_RX_ADV_ADDR_DONE_INTR_SHIFT (9U)
/*! reuse_rx_adv_addr_done_intr - Allow reuse of rx_adv_addr_done_intr for indicating the absence of
 *    advertiser address in the received advertising channel PDU, 0x0: rx_adv_addr_done_intr = 1
 *    for legacy and extended advertising channel packets, received with advertiser address
 *    rx_adv_addr_done_intr = 0 for extended, advertising channel packets received without advertiser address,
 *    0x1: rx_adv_addr_done_intr = 1 for legacy and extended advertising channel packets, with
 *    advertiser address and extended advertising channel , packets received without advertiser address
 *    (in conjunction with, adv_addr_not_present)
 */
#define BLE2_REG_BLE_REG_RX_CNTRL_REUSE_RX_ADV_ADDR_DONE_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RX_CNTRL_REUSE_RX_ADV_ADDR_DONE_INTR_SHIFT)) & BLE2_REG_BLE_REG_RX_CNTRL_REUSE_RX_ADV_ADDR_DONE_INTR_MASK)
/*! @} */

/*! @name BLE_REG_TXRX_CCM_CNTRL - CCM Operation (encryption/authentication) Control */
/*! @{ */

#define BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_CCM_EN_TX_MASK (0x1U)
#define BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_CCM_EN_TX_SHIFT (0U)
/*! ccm_en_tx - CCM (Encryption/Authentication) Enable for Tx packet */
#define BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_CCM_EN_TX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_CCM_EN_TX_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_CCM_EN_TX_MASK)

#define BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_CCM_EN_RX_MASK (0x2U)
#define BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_CCM_EN_RX_SHIFT (1U)
/*! ccm_en_rx - CCM (Encryption/Authentication) Enable for Rx packet */
#define BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_CCM_EN_RX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_CCM_EN_RX_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_CCM_EN_RX_MASK)

#define BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_AUTH_DISABLE_TX_MASK (0x4U)
#define BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_AUTH_DISABLE_TX_SHIFT (2U)
/*! auth_disable_tx - When ccm_en_tx = 1; setting 1 for CCM Enable for Tx Packet with encryption only and no authentication. */
#define BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_AUTH_DISABLE_TX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_AUTH_DISABLE_TX_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CCM_CNTRL_AUTH_DISABLE_TX_MASK)

