zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_TX_AES_CRC_COR_MASK (0x4000U)
#define BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_TX_AES_CRC_COR_SHIFT (14U)
/*! tx_aes_crc_cor - hardware Tx AES underflow CRC corruption enable, Enable CRC corruption at first
 *    16-bit of Tx CRC if Tx AES underflow error interrupt is detected. Only valid when software
 *    controlled err_inj_en is zero. All the CRC bits transmitted will be inverted to cause CRC
 *    failure on the receiving device., 0x0: disable, 0x1: enable
 */
#define BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_TX_AES_CRC_COR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_TX_AES_CRC_COR_SHIFT)) & BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_TX_AES_CRC_COR_MASK)

#define BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_TX_DMA_CRC_COR_MASK (0x8000U)
#define BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_TX_DMA_CRC_COR_SHIFT (15U)
/*! tx_dma_crc_cor - hardware Tx DMA CRC corruption enable, Enable CRC corruption at first 16-bit of
 *    Tx CRC if Tx DMA error interrupt is detected. Only valid when software controlled err_inj_en
 *    is zero. All the CRC bits transmitted will be inverted to cause CRC failure on the receiving
 *    device., 0x0: disable, 0x1: enable
 */
#define BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_TX_DMA_CRC_COR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_TX_DMA_CRC_COR_SHIFT)) & BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_TX_DMA_CRC_COR_MASK)

#define BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_ERR_INJ_PATTERN_MASK (0xFFFF0000U)
#define BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_ERR_INJ_PATTERN_SHIFT (16U)
/*! err_inj_pattern - 16-Bit Error injection pattern, 0x0: do not flip the bit, 0x1: flip the bit */
#define BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_ERR_INJ_PATTERN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_ERR_INJ_PATTERN_SHIFT)) & BLE2_REG_BLE_REG_TXRX_ERR_INJ_CNTRL_ERR_INJ_PATTERN_MASK)
/*! @} */

/*! @name BLE_REG_TXRX_CRC_CORRUPT - TxRx CRC Corruption Control */
/*! @{ */

#define BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_DMEM_CRC_COR_MASK (0x1U)
#define BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_DMEM_CRC_COR_SHIFT (0U)
/*! rx_dmem_crc_cor - hardware Rx DMEM underflow CRC corruption enable, Set this enable to enable
 *    CRC corruption if Rx DMEM underflow error interrupt is detected. Only valid when software
 *    controlled err_inj_en is zero. The crc_success bit is flipped at the end of Rx., 0x0: disable, 0x1:
 *    enable
 */
#define BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_DMEM_CRC_COR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_DMEM_CRC_COR_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_DMEM_CRC_COR_MASK)

#define BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_AES_CRC_COR_MASK (0x2U)
#define BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_AES_CRC_COR_SHIFT (1U)
/*! rx_aes_crc_cor - hardware Rx AES underflow CRC corruption enable, Set this enable to enable CRC
 *    corruption if Rx AES underflow error interrupt is detected. Only valid when software
 *    controlled err_inj_en is zero. The crc_success bit is flipped at the end of Rx, 0x0: disable, 0x1:
 *    enable
 */
#define BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_AES_CRC_COR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_AES_CRC_COR_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_AES_CRC_COR_MASK)

#define BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_DMA_CRC_COR_MASK (0x4U)
#define BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_DMA_CRC_COR_SHIFT (2U)
/*! rx_dma_crc_cor - hardware Rx DMA CRC corruption enable, Set this enable to enable CRC corruption
 *    if Rx DMA error interrupt is detected. Only valid when software controlled err_inj_en is
 *    zero. The crc_success bit is flipped at the end of Rx., 0x0: disable, 0x1: enable
 */
#define BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_DMA_CRC_COR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_DMA_CRC_COR_SHIFT)) & BLE2_REG_BLE_REG_TXRX_CRC_CORRUPT_RX_DMA_CRC_COR_MASK)
/*! @} */

/*! @name BLE_REG_RL_DELAY - BLE Register Loader Delay Register */
/*! @{ */

#define BLE2_REG_BLE_REG_RL_DELAY_COEX_LOCK_DELAY_MASK (0xFU)
#define BLE2_REG_BLE_REG_RL_DELAY_COEX_LOCK_DELAY_SHIFT (0U)
/*! coex_lock_delay - Register Loader ALternate Start Address, Programmable delay in quarter
 *    microseconds after btu_bt_req assertion to MRC when Coex lock fail condition is checked in BTU. MRC
 *    samples TX power and TX/RX frequency value from BTU after sampling all bt_state serial
 *    information. This delay is used to give more time for first 8 bytes of RL.
 */
#define BLE2_REG_BLE_REG_RL_DELAY_COEX_LOCK_DELAY(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_DELAY_COEX_LOCK_DELAY_SHIFT)) & BLE2_REG_BLE_REG_RL_DELAY_COEX_LOCK_DELAY_MASK)
/*! @} */

/*! @name BLE_REG_RL_START_ADDR_ALT - Register Loader Alternate Start Address */
/*! @{ */

#define BLE2_REG_BLE_REG_RL_START_ADDR_ALT_RL_START_ADDRESS_ALT_MASK (0xFFFFU)
#define BLE2_REG_BLE_REG_RL_START_ADDR_ALT_RL_START_ADDRESS_ALT_SHIFT (0U)
/*! rl_start_address_alt - Register Loader ALternate Start Address, This points to the alternate
 *    start address of memory structure that ble_reg_ldr should fetch from. This pointer is the only
 *    used when RL_alt is 1. In alternating mode; every alternate Register Loading is done from this
 *    pointer. Only Bits 15:0 are used from this register. The upper 16-bits are reused from
 *    BLE_REG_RL_START_ADDR
 */
#define BLE2_REG_BLE_REG_RL_START_ADDR_ALT_RL_START_ADDRESS_ALT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_START_ADDR_ALT_RL_START_ADDRESS_ALT_SHIFT)) & BLE2_REG_BLE_REG_RL_START_ADDR_ALT_RL_START_ADDRESS_ALT_MASK)
/*! @} */

/*! @name BLE_REG_RL_START_ADDR - Register Loader Start Address */
/*! @{ */

#define BLE2_REG_BLE_REG_RL_START_ADDR_RL_START_ADDRESS_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_RL_START_ADDR_RL_START_ADDRESS_SHIFT (0U)
/*! rl_start_address - Register Loader Start Address, This points to the start address of memory structure that ble_reg_ldr should fetch from. */
#define BLE2_REG_BLE_REG_RL_START_ADDR_RL_START_ADDRESS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_START_ADDR_RL_START_ADDRESS_SHIFT)) & BLE2_REG_BLE_REG_RL_START_ADDR_RL_START_ADDRESS_MASK)
/*! @} */

