zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
/*! @name BLE_REG_RL_CNTRL_STS - Register Loader Control and Status */
/*! @{ */

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_LOAD_CCM_MASK (0x1U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_LOAD_CCM_SHIFT (0U)
/*! load_ccm - Load CCM related memory content, For each new Connection Event; writing 1 will
 *    trigger BLE register loader to load only CCM related memory contents (memory offset = 0x20~44) to
 *    their BLE registers. This bit should be set along with load_non_ccm bit for packet events; to
 *    enable correct DBUS programming.This bit is self-cleared by hardware.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_LOAD_CCM(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_LOAD_CCM_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_LOAD_CCM_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_LOAD_NON_CCM_MASK (0x2U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_LOAD_NON_CCM_SHIFT (1U)
/*! load_non_ccm - Load non-CCM related memory content, For each new Connection Event; writing 1
 *    will trigger BLE register loader to load non-CCM related memory contents (memory offset =
 *    0x00~1C) to their BLE registers. This bit is self-cleared by hardware.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_LOAD_NON_CCM(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_LOAD_NON_CCM_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_LOAD_NON_CCM_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_AUTO_LOAD_CCM_MASK (0x4U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_AUTO_LOAD_CCM_SHIFT (2U)
/*! auto_load_ccm - Auto Load CCM related memory content, For each new Connection Event; writing 1
 *    will trigger BLE register loader to load only CCM related memory contents (memory offset =
 *    0x20~44) to their BLE registers at every start_rif_tx/start_rif_rx. This bit should be set along
 *    with auto_load_non_ccm bit for packet events; to enable correct DBUS programming. This bit is
 *    self-cleared by hardware.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_AUTO_LOAD_CCM(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_AUTO_LOAD_CCM_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_AUTO_LOAD_CCM_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_AUTO_LOAD_NON_CCM_MASK (0x8U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_AUTO_LOAD_NON_CCM_SHIFT (3U)
/*! auto_load_non_ccm - Auto Load non-CCM related memory content, For each new Connection Event;
 *    writing 1 will trigger BLE register loader to load non-CCM related memory contents (memory offset
 *    = 0x00~1C) to their BLE registers. This bit is self-cleared by hardware.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_AUTO_LOAD_NON_CCM(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_AUTO_LOAD_NON_CCM_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_AUTO_LOAD_NON_CCM_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_LOCK_MASK (0x10U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_LOCK_SHIFT (4U)
/*! rl_lock - BLE Register Loader Lock bit, For each new Connection Event; rl_lock serves as
 *    Register Loader lock bit. It should be set along with load_ccm or load_non_ccm bit or before
 *    start_rif_tx/rx time if using auto_load_ccm or auto_load_non_ccm bits. It must remain set for the
 *    duration of packets that the Register Loader values are in effect. At the end of last packet; the
 *    rl_lock bit should be cleared by firmware. This bit is used to generate rx_lock_fail_intr or
 *    tx_lock_fail_intr.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_LOCK(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_LOCK_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_LOCK_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_ALT_MASK (0x40U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_ALT_SHIFT (6U)
/*! rl_alt - BLE Register Loader Alternate Mode Enable, Indicates which RL_START_ADDR is to be
 *    used., 0x0: Always use RL_START_ADDR., 0x1: Use Toggle mode where RL_START_ADDR and
 *    RL_START_ADDR_ALT are used for, alternating register loading.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_ALT(x)  (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_ALT_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_ALT_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_ALT_RESET_MASK (0x80U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_ALT_RESET_SHIFT (7U)
/*! rl_alt_reset - BLE Register Loader Alternate Mode Reset, One-shot reset command to HW to use
 *    RL_START_ADDR pointer for the next register loading; regardless of which pointer was used in
 *    previous register loading. Self cleared by HW.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_ALT_RESET(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_ALT_RESET_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_ALT_RESET_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_COEX_LOCK_BYPASS_MASK (0x100U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_COEX_LOCK_BYPASS_SHIFT (8U)
/*! coex_lock_bypass - BLE Register Loader Coex Lock Bypass bit, Config bit to bypass coex lock fail
 *    detection on Register loader. Coex lock fail check can be bypassed by setting this bit to 1.
 *    This setting can be used if FW can pre-program the TX power and TX/RX frequency values in
 *    advance of a connection event without using register loader.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_COEX_LOCK_BYPASS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_COEX_LOCK_BYPASS_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_COEX_LOCK_BYPASS_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_CCM_DONE_MASK (0x10000U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_CCM_DONE_SHIFT (16U)
/*! rl_ccm_done - Done loading CCM memory, Register Loader has done loading CCM related memory
 *    content into their BLE registers., 0x0: Not done., 0x1: Done loading.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_CCM_DONE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_CCM_DONE_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_CCM_DONE_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_NON_CCM_DONE_MASK (0x20000U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_NON_CCM_DONE_SHIFT (17U)
/*! rl_non_ccm_done - Done loading non-CCM memory, Register Loader has done loading non-CCM related
 *    memory content into their BLE registers., 0x0: Not done., 0x1: Done loading.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_NON_CCM_DONE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_NON_CCM_DONE_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_NON_CCM_DONE_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_BUSY_MASK (0x40000U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_BUSY_SHIFT (18U)
/*! rl_busy - Register Loader busy, Status indicating BLE Register Loader is busy. Asserted when
 *    fetching memory starts and de-asserted right after done writing to BLE registers., 0x0: Register
 *    Loader is idle., 0x1: Register Loader is busy.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_BUSY(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_BUSY_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_BUSY_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_DMA_ERR_MASK (0x80000U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_DMA_ERR_SHIFT (19U)
/*! rl_dma_err - Register Loader Has DMA Error, Register Loader experienced DMA error., 0x0: No
 *    error, 0x1: SoC DMA slave has replied with ERROR response during Register Loader read, transfers.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_DMA_ERR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_DMA_ERR_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_DMA_ERR_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_COEX_DONE_MASK (0x200000U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_COEX_DONE_SHIFT (21U)
/*! rl_coex_done - Coex Register Loading Done, Indicating Coex related register loading is done;
 *    i.e. the first 8 bytes of register loader., 0x0: Not done., 0x1: Done.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_COEX_DONE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_COEX_DONE_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_COEX_DONE_MASK)

