zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_DBUS_DONE_MASK (0x400000U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_DBUS_DONE_SHIFT (22U)
/*! rl_dbus_done - DBUS Register Loading Done, Indicating DBUS WDATA loading is done for the first
 *    12 bytes of register loader., 0x0: Not done., 0x1: Done.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_DBUS_DONE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_DBUS_DONE_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_DBUS_DONE_MASK)

#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_AT_CURR_MASK (0x800000U)
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_AT_CURR_SHIFT (23U)
/*! rl_at_curr - Register Loader Alternate Pointer, Indicates which RL pointer is currently in use.
 *    When RL_alt = 0; this bit is always 0. when RL_alt = 1; this bit toggles for every register
 *    loading to indicate the Register Loader in use.
 */
#define BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_AT_CURR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_AT_CURR_SHIFT)) & BLE2_REG_BLE_REG_RL_CNTRL_STS_RL_AT_CURR_MASK)
/*! @} */

/*! @name BLE_REG_DFE_PKT_EXTENSION_CNTRL - Tx/Rx Packet Extension Control, Control register to Data Field Extension after CRC for BLE location packet. */
/*! @{ */

#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_TX_EXTN_PATTERN_MASK (0x1U)
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_TX_EXTN_PATTERN_SHIFT (0U)
/*! tx_extn_pattern - Tx Packet Extension Pattern, The value programmed in this bit reflects what
 *    will be sent out during the extension part of the Tx location packet. This value is also sent
 *    during the guard time at the beginning of the extension field., This bit is valid ONLY when
 *    tx_extn_en is set., 0x0: send 0000..., 0x1: send 1111...
 */
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_TX_EXTN_PATTERN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_TX_EXTN_PATTERN_SHIFT)) & BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_TX_EXTN_PATTERN_MASK)

#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_DELAY_EXTN_END_MASK (0x2U)
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_DELAY_EXTN_END_SHIFT (1U)
/*! delay_extn_end - Extension Packet Delay CDT, Define whether to delay CDT timer to start at
 *    packet estimated end time if extension field is corrupted due to antSwitchStatus (for example; BCA
 *    antenna is not honored) de-assertion; or due to BCA grant loss., If it is set; CDT timer needs
 *    to be delayed to the estimated end of extension filed time to line up the TIFS for next
 *    packet., If it is not set; for the same conditions; do not perform any CDT manipulation in
 *    hardware. This setting might cause BLE not to be able to Tx or Rx following the packet extension
 *    corruption., 0x0: do not perform any CDT manipulation in hardware, 0x1: delay CDT timer to the
 *    estimated end of extension
 */
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_DELAY_EXTN_END(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_DELAY_EXTN_END_SHIFT)) & BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_DELAY_EXTN_END_MASK)

#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_IQ_SAMPLE_RATE_MASK (0xCU)
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_IQ_SAMPLE_RATE_SHIFT (2U)
/*! rx_iq_sample_rate - Rx IQ Sampling Rate, Define reception rate for IQ samples in extension
 *    field., 0x0: receive IQ sample every 4 usec, 0x1: receive IQ sample every 2 usec, 0x2: receive IQ
 *    sample every 1 usec, 0x3: not valid
 */
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_IQ_SAMPLE_RATE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_IQ_SAMPLE_RATE_SHIFT)) & BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_IQ_SAMPLE_RATE_MASK)

#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_EXTN_GUARD_TIME_MASK (0x30U)
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_EXTN_GUARD_TIME_SHIFT (4U)
/*! extn_guard_time - Extension Packet Guard Time, Define the guard interval between the CRC and
 *    extension supplementals in the unit of usec., 0x0: guard interval is 1 usec, 0x1: guard interval
 *    is 2 usec, 0x2: guard interval is 3 usec, 0x3: guard interval is 4 usec
 */
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_EXTN_GUARD_TIME(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_EXTN_GUARD_TIME_SHIFT)) & BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_EXTN_GUARD_TIME_MASK)

#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_EXTN_REF_ANT_TIME_MASK (0xC0U)
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_EXTN_REF_ANT_TIME_SHIFT (6U)
/*! extn_ref_ant_time - Extension Reference Antenna IQ Sample Time, Define the reference antenna
 *    interval after the extension guard time and before switching antenna in the unit of usec. During
 *    this interval; IQ samples received is considered in the same of which the reference antenna is
 *    used., 0x0: reference antenna interval is 0 usec, 0x1: reference antenna interval is 2 usec,
 *    0x2: reference antenna interval is 4 usec, 0x3: reference antenna interval is 8 usec
 */
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_EXTN_REF_ANT_TIME(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_EXTN_REF_ANT_TIME_SHIFT)) & BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_EXTN_REF_ANT_TIME_MASK)

#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_EXTN_EN_MASK (0x10000U)
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_EXTN_EN_SHIFT (16U)
/*! rx_extn_en - Rx Packet Extension Enable, Enable bit of Rx extension packet., 0x0: disable to
 *    receive data extension, 0x1: enable to receive data extension
 */
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_EXTN_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_EXTN_EN_SHIFT)) & BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_EXTN_EN_MASK)

#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_IQ_SAMPLE_RATE_RCV_OVERRIDE_MASK (0x20000U)
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_IQ_SAMPLE_RATE_RCV_OVERRIDE_SHIFT (17U)
/*! rx_iq_sample_rate_rcv_override - Rx Packet Extension IQ Sample Rate Override, When this is set
 *    and received packet is an AoD packet with extension field; IQ sample rate is derived from
 *    received supplemental type field of supplemental info byte; which is considered to override the
 *    software preset sample rate.
 */
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_IQ_SAMPLE_RATE_RCV_OVERRIDE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_IQ_SAMPLE_RATE_RCV_OVERRIDE_SHIFT)) & BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_IQ_SAMPLE_RATE_RCV_OVERRIDE_MASK)

#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_EXTN_SW_OVERRIDE_EN_MASK (0x40000U)
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_EXTN_SW_OVERRIDE_EN_SHIFT (18U)
/*! rx_extn_sw_override_en - Rx Extension Packet Software Override, Software enable bit to override
 *    rx_extn_rcv and rx_extn_length from Rx PDU header., 0x0: disable software override, 0x1:
 *    enable software override
 */
#define BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_EXTN_SW_OVERRIDE_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_EXTN_SW_OVERRIDE_EN_SHIFT)) & BLE2_REG_BLE_REG_DFE_PKT_EXTENSION_CNTRL_RX_EXTN_SW_OVERRIDE_EN_MASK)

