zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_EN_MASK (0x20000U)
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_EN_SHIFT (17U)
/*! simul_scan_en - Simultaneous Scan Enable, Enable simultaneous scan mode to receive BLE 1M and
 *    coded PHY ADV packets; whichever has correlation hit first., 0x0: disable, 0x1: enable. When
 *    enabled; rx_coded_pkt_en bit must set to 0.
 */
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_EN_SHIFT)) & BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_EN_MASK)

#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_1M_MASK (0x40000U)
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_1M_SHIFT (18U)
/*! simul_scan_1m - Simultaneous Scan Results in 1M Mode; if Concurrent Correlation Hit., When
 *    simul_scan_en is 1; if both 1M and coded PHY correlators have correlation hit at the same time;
 *    this bit decides which mode to continue Rx. This bit has no effect if only 1 of the correlator
 *    has correlation hit., 0x0: Continue Rx in coded PHY packet mode - preferred as it takes longer
 *    time to, correlate the access address., 0x1: Continue Rx in BLE 1M mode.
 */
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_1M(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_1M_SHIFT)) & BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_1M_MASK)
/*! @} */

/*! @name BLE_REG_IRK_BASE_ADDR - IRK Resolution Base address */
/*! @{ */

#define BLE2_REG_BLE_REG_IRK_BASE_ADDR_IRK_BASE_ADDR_MASK (0x3FFFU)
#define BLE2_REG_BLE_REG_IRK_BASE_ADDR_IRK_BASE_ADDR_SHIFT (0U)
/*! irk_base_addr - IRK Base Address, Programmable start of IRK storage address in EBRAM. EBRAM is
 *    shared with BrEdr logic. Therefore this start address is programmable; so that different
 *    platforms may be able to use different EBRAM configurations.
 */
#define BLE2_REG_BLE_REG_IRK_BASE_ADDR_IRK_BASE_ADDR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IRK_BASE_ADDR_IRK_BASE_ADDR_SHIFT)) & BLE2_REG_BLE_REG_IRK_BASE_ADDR_IRK_BASE_ADDR_MASK)
/*! @} */

/*! @name BLE_REG_IRK_CTRL_0 - IRK Resolution Control 0 */
/*! @{ */

#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_HASH_MASK (0xFFFFFFU)
#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_HASH_SHIFT (0U)
/*! sw_irk_hash - Software provided hash for IRK resolution, To perform a software driven IRK
 *    resolution; software writes the lower 24 bits of RPA address into this register. This value is
 *    called hash and is compared with hardware calculated hash to conclude on whether the key can be
 *    used to resolve addresses.
 */
#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_HASH(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_HASH_SHIFT)) & BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_HASH_MASK)

#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_PRAND_MASK (0xFF000000U)
#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_PRAND_SHIFT (24U)
/*! sw_irk_prand - Software provided prand for IRK resolution, To perform a software driven IRK
 *    resolution; software writes part of upper 24 bits of RPA address into this register. This value is
 *    called prand[7:0] and is used to generate local hash.
 */
#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_PRAND(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_PRAND_SHIFT)) & BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_PRAND_MASK)
/*! @} */

/*! @name BLE_REG_IRK_CTRL_1 - IRK Resolution Control 1 */
/*! @{ */

#define BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_PRAND_MASK (0xFFFFU)
#define BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_PRAND_SHIFT (0U)
/*! sw_irk_prand - Software provided hash for IRK resolution, To perform a software driven IRK
 *    resolution; software writes part of upper 24 bits of RPA address into this register. This value is
 *    called prand[23:8] and is used to generate local hash.
 */
#define BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_PRAND(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_PRAND_SHIFT)) & BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_PRAND_MASK)

#define BLE2_REG_BLE_REG_IRK_CTRL_1_IRK_RESOLUTION_EN_MASK (0x10000U)
#define BLE2_REG_BLE_REG_IRK_CTRL_1_IRK_RESOLUTION_EN_SHIFT (16U)
/*! irk_resolution_en - IRK resolution enable, When this bit is set; hardware will parse incoming
 *    advt channel packets to attempt IRK resolution on resolvable private addresses. This bit does
 *    not affect software override/access to IRK locations in hardware EBRAM area. So; disabling this
 *    bit can be used as a backup to stop hardware driven IRK resolving; and use software provided
 *    values after packet has been fully received.
 */
#define BLE2_REG_BLE_REG_IRK_CTRL_1_IRK_RESOLUTION_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IRK_CTRL_1_IRK_RESOLUTION_EN_SHIFT)) & BLE2_REG_BLE_REG_IRK_CTRL_1_IRK_RESOLUTION_EN_MASK)

#define BLE2_REG_BLE_REG_IRK_CTRL_1_IRK_SW_LOCK_MASK (0x20000U)
#define BLE2_REG_BLE_REG_IRK_CTRL_1_IRK_SW_LOCK_SHIFT (17U)
/*! irk_sw_lock - Lock bits for Software IRK queue access, This bit allows software and hardware to
 *    access the EBRAM IRK queue locations safely., 0x0: IRK queue is not in use by software, 0x1:
 *    IRK queue is in use by software
 */
#define BLE2_REG_BLE_REG_IRK_CTRL_1_IRK_SW_LOCK(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IRK_CTRL_1_IRK_SW_LOCK_SHIFT)) & BLE2_REG_BLE_REG_IRK_CTRL_1_IRK_SW_LOCK_MASK)

#define BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_RESOLVE_CMD_MASK (0x40000U)
#define BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_RESOLVE_CMD_SHIFT (18U)
/*! sw_irk_resolve_cmd - Software IRK resolve command, This self clearing bit triggers a software
 *    requested IRK resolution process. The prand and hash values are provided in sw_irk_hash and
 *    sw_irk_prand fields. The software lock bit irk_sw_lock; should be set to 1 before the command is
 *    set. Self cleared by hardware
 */
#define BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_RESOLVE_CMD(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_RESOLVE_CMD_SHIFT)) & BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_RESOLVE_CMD_MASK)

