zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
/*! @name BLE_REG_WHITELIST_CTRL_0 - Whitelist Search Control 0 */
/*! @{ */

#define BLE2_REG_BLE_REG_WHITELIST_CTRL_0_SW_WL_DEVICE_ADDR_0_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_0_SW_WL_DEVICE_ADDR_0_SHIFT (0U)
/*! sw_wl_device_addr_0 - Software provided device address for whitelist search, To perform a
 *    software whitelist query; software writes the lower 32 bits of device address into this register.
 *    This value is used together with some fields in next register BLE_REG_WHITELIST_CTRL_1.
 */
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_0_SW_WL_DEVICE_ADDR_0(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_CTRL_0_SW_WL_DEVICE_ADDR_0_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_CTRL_0_SW_WL_DEVICE_ADDR_0_MASK)
/*! @} */

/*! @name BLE_REG_WHITELIST_CTRL_1 - Whitelist Search Control 1 */
/*! @{ */

#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_DEVICE_ADDR_1_MASK (0xFFFFU)
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_DEVICE_ADDR_1_SHIFT (0U)
/*! sw_wl_device_addr_1 - Software provided Device address for whitelist search, To perform a
 *    software whitelist query; software writes the upper 16 bits of device address into this register.
 *    Together with BLE_REG_WHITELIST_CTRL_0; this represents the 48-bit device address for software
 *    white list lookup.
 */
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_DEVICE_ADDR_1(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_DEVICE_ADDR_1_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_DEVICE_ADDR_1_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_DEVICE_TYPE_MASK (0x10000U)
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_DEVICE_TYPE_SHIFT (16U)
/*! sw_wl_device_type - Software provided Device address type for whitelist search, This bit
 *    specifies the device address type to be used for software whitelist query., 0x0: public address, 0x1:
 *    random address
 */
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_DEVICE_TYPE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_DEVICE_TYPE_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_DEVICE_TYPE_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_QUERY_CMD_MASK (0x20000U)
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_QUERY_CMD_SHIFT (17U)
/*! sw_wl_query_cmd - Software whitelist query command, This self clearing bit triggers a software
 *    requested whitelist search for the device specified by sw_wl_device_type; sw_wl_device_addr_1
 *    and sw_wl_device_addr_0 fields. The lock bit wl_sw_lock; should be set to 1 before the command
 *    is set. Self cleared by hardware.
 */
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_QUERY_CMD(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_QUERY_CMD_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_CTRL_1_SW_WL_QUERY_CMD_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_WL_SW_LOCK_MASK (0x40000U)
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_WL_SW_LOCK_SHIFT (18U)
/*! wl_sw_lock - Lock bits for software whitelist access, This bit should be set by software when it
 *    is modifying the EBRAM whitelist area, 0x0: whitelist is not in use by software, 0x1:
 *    whitelist is in use by software
 */
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_WL_SW_LOCK(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_CTRL_1_WL_SW_LOCK_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_CTRL_1_WL_SW_LOCK_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_HW_WL_SEARCH_EN_MASK (0x80000U)
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_HW_WL_SEARCH_EN_SHIFT (19U)
/*! hw_wl_search_en - Inline White list search enable, When this bit is set; hardware will parse
 *    incoming advt channel packets to attempt white list filtering inline. This bit does not affect
 *    software override/access to the whitelist operations in hardware EBRAM area. So; disabling this
 *    bit can be used as a backup to stop hardware driven whitelist searching; and use software
 *    provided values after packet has been fully received.
 */
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_HW_WL_SEARCH_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_CTRL_1_HW_WL_SEARCH_EN_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_CTRL_1_HW_WL_SEARCH_EN_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_KILL_WL_SEARCH_MASK (0x100000U)
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_KILL_WL_SEARCH_SHIFT (20U)
/*! kill_wl_search - Kill whitelist search, This bit will kill whitelist search process and put the
 *    state machine back to idle. Software is responsible to clear this bit., 0x0: whitelist search
 *    is not killed, 0x1: whitelist search is killed by software
 */
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_KILL_WL_SEARCH(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_CTRL_1_KILL_WL_SEARCH_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_CTRL_1_KILL_WL_SEARCH_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_WHITELIST_LENGTH_MASK (0xFF000000U)
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_WHITELIST_LENGTH_SHIFT (24U)
/*! whitelist_length - Length of whitelist in EBRAM, Specifies valid whitelist length. All values
 *    between 0 to 255 are valid. If whitelist is empty; this value should be set to 0.
 */
#define BLE2_REG_BLE_REG_WHITELIST_CTRL_1_WHITELIST_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_CTRL_1_WHITELIST_LENGTH_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_CTRL_1_WHITELIST_LENGTH_MASK)
/*! @} */

/*! @name BLE_REG_WHITELIST_STATUS - Whitelist Search Status */
/*! @{ */

#define BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_RESULT_MASK (0x3U)
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_RESULT_SHIFT (0U)
/*! hw_wl_lookup_result - Result of latest hardware white list lookup, The values indicate if query
 *    is finished or ongoing; successful or unsuccessful., 0x0: lookup in progress, 0x1: entry was
 *    found in whitelist, 0x2: entry was not found in whitelist, 0x3: whitelist search not done for
 *    this packet
 */
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_RESULT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_RESULT_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_RESULT_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_STATUS_WL_HW_LOCK_MASK (0x4U)
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_WL_HW_LOCK_SHIFT (2U)
/*! wl_hw_lock - Lock bits for Hardware whitelist access, This bit allows software and hardware to
 *    access the EBRAM whitelist locations safely., 0x0: whitelist is not in use by hardware, 0x1:
 *    whitelist is in use by hardware
 */
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_WL_HW_LOCK(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_STATUS_WL_HW_LOCK_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_STATUS_WL_HW_LOCK_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_STATUS_WL_FSM_STATE_MASK (0xF0U)
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_WL_FSM_STATE_SHIFT (4U)
/*! wl_fsm_state - Whitelist search state machine status, This is the whitelist state machine; e.g. wl_fsm_state; current value */
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_WL_FSM_STATE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_STATUS_WL_FSM_STATE_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_STATUS_WL_FSM_STATE_MASK)

