zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_POSITION_MASK (0xFF00U)
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_POSITION_SHIFT (8U)
/*! hw_wl_lookup_position - Position of last hardware whitelist lookup in EBRAM, For successful
 *    lookups; it is the offset where specified address is located in the whitelist. For unsuccessful
 *    lookups; this is the offset to be asserted. For example; if specified address is between offset
 *    3 and 4; it reports 4 which is the offset software will insert for the specified address. If
 *    whitelist_length = 10; the entry position is 0 to 9; and if the specified address is bigger
 *    than the offset 9th entry; it will report 10. For the extreme case (whitelist_length = 255; and
 *    the specified address is bigger than the offset 254th entry); it reports 255.
 */
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_POSITION(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_POSITION_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_POSITION_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_RESULT_MASK (0x30000U)
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_RESULT_SHIFT (16U)
/*! sw_wl_lookup_result - Result of latest software white list lookup, The values indicate if query
 *    is finished or ongoing; successful or unsuccessful., 0x0: lookup in progress, 0x1: entry was
 *    found in whitelist, 0x2: entry was not found in whitelist, 0x3: whitelist search not done for
 *    this software command
 */
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_RESULT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_RESULT_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_RESULT_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_POSITION_MASK (0xFF000000U)
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_POSITION_SHIFT (24U)
/*! sw_wl_lookup_position - Position of last software whitelist lookup in EBRAM, For successful
 *    lookups; it is the offset where specified address is located in the whitelist. For unsuccessful
 *    lookups; this is the offset to be asserted. For example; if specified address is between offset
 *    3 and 4; it reports 4 which is the offset software will insert for the specified address. If
 *    whitelist_length = 10; the entry position is 0 to 9; and if the specified address is bigger
 *    than the offset 9th entry; it will report 10. For the extreme case (whitelist_length = 255; and
 *    the specified address is bigger than the offset 254th entry); it reports 255.
 */
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_POSITION(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_POSITION_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_POSITION_MASK)
/*! @} */

/*! @name BLE_REG_TD_START_ADDR - Tx Descriptor Start Address */
/*! @{ */

#define BLE2_REG_BLE_REG_TD_START_ADDR_TD_START_ADDRESS_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_TD_START_ADDR_TD_START_ADDRESS_SHIFT (0U)
/*! td_start_address - Tx Descriptor Start Address, The currently active TD (Tx Descriptor) is pointed by td_start_address. */
#define BLE2_REG_BLE_REG_TD_START_ADDR_TD_START_ADDRESS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_START_ADDR_TD_START_ADDRESS_SHIFT)) & BLE2_REG_BLE_REG_TD_START_ADDR_TD_START_ADDRESS_MASK)
/*! @} */

/*! @name BLE_REG_TD_STATUS - Tx Descriptor Status */
/*! @{ */

#define BLE2_REG_BLE_REG_TD_STATUS_TD_BUSY_MASK  (0x1U)
#define BLE2_REG_BLE_REG_TD_STATUS_TD_BUSY_SHIFT (0U)
/*! td_busy - TD busy, Status indicating the active TD is busy and being used by hardware. Asserted
 *    when fetching TD starts and de-asserted right after TD status writes back., 0x0: TD is idle,
 *    0x1: TD is busy and being used by hardware
 */
#define BLE2_REG_BLE_REG_TD_STATUS_TD_BUSY(x)    (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_STATUS_TD_BUSY_SHIFT)) & BLE2_REG_BLE_REG_TD_STATUS_TD_BUSY_MASK)

#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ANT_SWITCH_FAIL_MASK (0x4U)
#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ANT_SWITCH_FAIL_SHIFT (2U)
/*! tx_extn_ant_switch_fail - Tx antenna switch status on packet extension, Status indicating the Tx
 *    antenna switch for the current transmitted extension has failed., 0x0: Tx antenna switch
 *    pattern is honored; antSwitchStatus was never de-asserted, during packet extension, 0x1: Tx
 *    antenna switch pattern is not honored
 */
#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ANT_SWITCH_FAIL(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ANT_SWITCH_FAIL_SHIFT)) & BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ANT_SWITCH_FAIL_MASK)

#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ABORT_MASK (0x8U)
#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ABORT_SHIFT (3U)
/*! tx_extn_abort - Tx extension packet hardware abort status, Status indicating the Tx extension
 *    packet is aborted by hardware., 0x0: No abort condition happened during Tx extension, 0x1:
 *    hardware abort condition was detected during Tx extension
 */
#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ABORT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ABORT_SHIFT)) & BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ABORT_MASK)

#define BLE2_REG_BLE_REG_TD_STATUS_TX_HAS_ERR_MASK (0x10U)
#define BLE2_REG_BLE_REG_TD_STATUS_TX_HAS_ERR_SHIFT (4U)
/*! tx_has_err - Tx Has Error, Tx packet of using this TD experienced at least 1 of the following
 *    errors., 0x0: No error, 0x1: At least 1 of rif_abort_tx; tx_dmem_underflow_intr;
 *    tx_aes_underflow_intr and, tx_lock_fail_intr has been asserted during packet transmission
 */
#define BLE2_REG_BLE_REG_TD_STATUS_TX_HAS_ERR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_STATUS_TX_HAS_ERR_SHIFT)) & BLE2_REG_BLE_REG_TD_STATUS_TX_HAS_ERR_MASK)

#define BLE2_REG_BLE_REG_TD_STATUS_TX_DMA_ERR_MASK (0x20U)
#define BLE2_REG_BLE_REG_TD_STATUS_TX_DMA_ERR_SHIFT (5U)
/*! tx_dma_err - Tx Has DMA Error, Tx packet of using this TD experienced DMA error., 0x0: No error,
 *    0x1: SoC DMA slave has replied with ERROR response during packet transmission
 */
#define BLE2_REG_BLE_REG_TD_STATUS_TX_DMA_ERR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_STATUS_TX_DMA_ERR_SHIFT)) & BLE2_REG_BLE_REG_TD_STATUS_TX_DMA_ERR_MASK)

