zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_TD_STATUS_TX_RL_LOCKFAIL_STS_MASK (0x40U)
#define BLE2_REG_BLE_REG_TD_STATUS_TX_RL_LOCKFAIL_STS_SHIFT (6U)
/*! tx_rl_lockfail_sts - Tx Has RL lock fail, Status indicating Tx packet has lock fail because of
 *    register loader, 0x0: No error, 0x1: Tx_lock_fail_intr has been asserted during packet
 *    transmission
 */
#define BLE2_REG_BLE_REG_TD_STATUS_TX_RL_LOCKFAIL_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_STATUS_TX_RL_LOCKFAIL_STS_SHIFT)) & BLE2_REG_BLE_REG_TD_STATUS_TX_RL_LOCKFAIL_STS_MASK)
/*! @} */

/*! @name BLE_REG_RD_START_ADDR - Rx Descriptor Start Address */
/*! @{ */

#define BLE2_REG_BLE_REG_RD_START_ADDR_RD_START_ADDRESS_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_RD_START_ADDR_RD_START_ADDRESS_SHIFT (0U)
/*! rd_start_address - Rx Descriptor Start Address, The currently active RD (Rx Descriptor) is pointed by rd_start_address. */
#define BLE2_REG_BLE_REG_RD_START_ADDR_RD_START_ADDRESS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_START_ADDR_RD_START_ADDRESS_SHIFT)) & BLE2_REG_BLE_REG_RD_START_ADDR_RD_START_ADDRESS_MASK)
/*! @} */

/*! @name BLE_REG_RD_STATUS - Rx Descriptor Status */
/*! @{ */

#define BLE2_REG_BLE_REG_RD_STATUS_RD_BUSY_MASK  (0x1U)
#define BLE2_REG_BLE_REG_RD_STATUS_RD_BUSY_SHIFT (0U)
/*! rd_busy - RD busy, Status indicating the active RD is busy and being used by hardware. Asserted
 *    when fetching RD starts and de-asserted right after RD status writes back., 0x0: RD is idle,
 *    0x1: RD is busy and being used by hardware
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RD_BUSY(x)    (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RD_BUSY_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RD_BUSY_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_RCV_MASK (0x2U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_RCV_SHIFT (1U)
/*! rx_extn_rcv - Extension Packet Received, This bit is valid ONLY on received packets when CRC has
 *    passed., 0x0: regular Rx packet was received, 0x1: extension field packet was received
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_RCV(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_RCV_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_RCV_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ANT_SWITCH_FAIL_MASK (0x4U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ANT_SWITCH_FAIL_SHIFT (2U)
/*! rx_extn_ant_switch_fail - Rx antenna switch status on packet extension, Status indicating the Rx
 *    antenna switch for the current receiving extension has failed., 0x0: Rx antenna switch
 *    pattern is honored; antSwitchStatus was never de-asserted, during packet extension, 0x1: Rx antenna
 *    switch pattern is not honored
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ANT_SWITCH_FAIL(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ANT_SWITCH_FAIL_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ANT_SWITCH_FAIL_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ABORT_MASK (0x8U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ABORT_SHIFT (3U)
/*! rx_extn_abort - Rx extension packet hardware abort status, Status indicating the Rx extension
 *    packet is aborted by hardware., 0x0: no abort condition happened during Rx extension, 0x1:
 *    hardware abort condition was detected during Rx extension
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ABORT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ABORT_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ABORT_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_HAS_ERR_MASK (0x10U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_HAS_ERR_SHIFT (4U)
/*! rx_has_err - Rx Has Error, Rx packet of using this RD experienced at least 1 of the following
 *    errors., 0x0: No error, 0x1: At least 1 of rif_abort_rx; rx_dmem_overflow_intr;
 *    rx_aes_underflow_intr and, rx_lock_fail_intr has been asserted during packet reception
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_HAS_ERR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_HAS_ERR_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_HAS_ERR_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_DMA_ERR_MASK (0x20U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_DMA_ERR_SHIFT (5U)
/*! rx_dma_err - Rx Has DMA Error, Rx packet of using this RD experienced DMA error., 0x0: No error,
 *    0x1: SoC DMA slave has replied with ERROR response during packet reception
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_DMA_ERR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_DMA_ERR_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_DMA_ERR_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_RL_LOCKFAIL_STS_MASK (0x40U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_RL_LOCKFAIL_STS_SHIFT (6U)
/*! rx_rl_lockfail_sts - Rx Has RL lock fail, Status indicating Rx packet has lock fail because of
 *    register loader, 0x0: No error, 0x1: Rx_lock_fail_intr has been asserted during packet
 *    transmission
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_RL_LOCKFAIL_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_RL_LOCKFAIL_STS_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_RL_LOCKFAIL_STS_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RD_ALT_CURR_MASK (0x80U)
#define BLE2_REG_BLE_REG_RD_STATUS_RD_ALT_CURR_SHIFT (7U)
/*! rd_alt_curr - Current RD in use, This bit indicates which RD pointer is currently in use. When
 *    rd_alt is 0 this bit is always 0; when rd_alt = 1 this bit toggles for every RX to indicate the
 *    RD in use., 0x0: Normal RD is being used, 0x1: Alternate RD is being used
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RD_ALT_CURR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RD_ALT_CURR_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RD_ALT_CURR_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_LENGTH_MASK (0xFF00U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_LENGTH_SHIFT (8U)
/*! rx_extn_length - Rx Extension Length, Length of valid I/Q samples received. The value is in the
 *    unit of 8 usec time frame. BLE still sends this I/Q samples to memory for firmware and
 *    indicates the valid number of samples in this field even though Rx was aborted during the extension
 *    reception., This bit is valid ONLY when rx_extn_rcv bit is set.
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_LENGTH_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_LENGTH_MASK)
/*! @} */

/*! @name BLE_REG_RSSI_ARB_CTRL - BLE RSSI ARBITRATION CONTROL */
/*! @{ */

#define BLE2_REG_BLE_REG_RSSI_ARB_CTRL_BLE_ARB_RSSI_VAL_MASK (0xFFU)
#define BLE2_REG_BLE_REG_RSSI_ARB_CTRL_BLE_ARB_RSSI_VAL_SHIFT (0U)
/*! ble_arb_rssi_val - Software programable RSSI value for RSSI based arbitration */
#define BLE2_REG_BLE_REG_RSSI_ARB_CTRL_BLE_ARB_RSSI_VAL(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RSSI_ARB_CTRL_BLE_ARB_RSSI_VAL_SHIFT)) & BLE2_REG_BLE_REG_RSSI_ARB_CTRL_BLE_ARB_RSSI_VAL_MASK)
/*! @} */

/*! @name BLE_REG_RD_START_ADDR_ALT - Alternate Rx Descriptor Start Address */
/*! @{ */

#define BLE2_REG_BLE_REG_RD_START_ADDR_ALT_RD_START_ADDRESS_ALT_MASK (0xFFFFU)
#define BLE2_REG_BLE_REG_RD_START_ADDR_ALT_RD_START_ADDRESS_ALT_SHIFT (0U)
/*! rd_start_address_alt - Alternate Rx Descriptor Start Address, The Alternate RD (Rx Descriptor) is pointed by rd_start_address_alt. */
#define BLE2_REG_BLE_REG_RD_START_ADDR_ALT_RD_START_ADDRESS_ALT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_START_ADDR_ALT_RD_START_ADDRESS_ALT_SHIFT)) & BLE2_REG_BLE_REG_RD_START_ADDR_ALT_RD_START_ADDRESS_ALT_MASK)
/*! @} */

/*! @name BLE_REG_RD_CTRL - Rx Descriptor Control */
/*! @{ */

#define BLE2_REG_BLE_REG_RD_CTRL_RD_ALT_MASK     (0x1U)
#define BLE2_REG_BLE_REG_RD_CTRL_RD_ALT_SHIFT    (0U)
/*! rd_alt - Toggle mode for RD_START_ADDRESS, This bit indicates which RD_START_ADDRESS is to be
 *    used, 0x0: always use rd_start_address, 0x1: use Toggle mode where rd_start_address and
 *    rd_start_address_alt are used for, alternating RX
 */
#define BLE2_REG_BLE_REG_RD_CTRL_RD_ALT(x)       (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_CTRL_RD_ALT_SHIFT)) & BLE2_REG_BLE_REG_RD_CTRL_RD_ALT_MASK)

#define BLE2_REG_BLE_REG_RD_CTRL_RD_ALT_RESET_MASK (0x2U)
#define BLE2_REG_BLE_REG_RD_CTRL_RD_ALT_RESET_SHIFT (1U)
/*! rd_alt_reset - Reset bit, This bit is used to reset the alternating mode, 0x0: No reset, 0x1:
 *    reset; use the RD_START_ADDRESS for the next pkt irrespective of what was used, for the previous
 *    pkt
 */
#define BLE2_REG_BLE_REG_RD_CTRL_RD_ALT_RESET(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_CTRL_RD_ALT_RESET_SHIFT)) & BLE2_REG_BLE_REG_RD_CTRL_RD_ALT_RESET_MASK)
/*! @} */

/*! @name BLE_REG_CLK_CTRL_SLEEP_OK_TIMER - BLE sleep ok timer */
/*! @{ */

#define BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_SLEEP_OK_TIMER_MASK (0x3FFU)
#define BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_SLEEP_OK_TIMER_SHIFT (0U)
/*! sleep_ok_timer - sys_clk_sync_sleep_ok will deassert at timer expiration */
#define BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_SLEEP_OK_TIMER(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_SLEEP_OK_TIMER_SHIFT)) & BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_SLEEP_OK_TIMER_MASK)

#define BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_ASLV_LAT_OPT_EN_MASK (0x10000U)
#define BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_ASLV_LAT_OPT_EN_SHIFT (16U)
/*! aslv_lat_opt_en - ahb access 4mclk domain register adaptive mechanism control bit, This bit
 *    enables or disables the adaptive mechanism inside the BLE AHB slave that is intended to improve
 *    latencies towards 4MHz domain registers. To restart the mechanism; after changing the SYS clock
 *    frequency; program it to 0 and back to 1. No r/w delays are needed. It is not necessary to
 *    restart the mechanism when switching to higher SYS clock frequency., 0x0: Disable the adaptive
 *    mechanism., 0x1: Enable the adaptive mechanism by default
 */
#define BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_ASLV_LAT_OPT_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_ASLV_LAT_OPT_EN_SHIFT)) & BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_ASLV_LAT_OPT_EN_MASK)
/*! @} */

/*! @name BLE_REG_AES_CNTRL - AES Control */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_CNTRL_SW_AES_GO_DYN_MASK (0x1U)
#define BLE2_REG_BLE_REG_AES_CNTRL_SW_AES_GO_DYN_SHIFT (0U)
/*! sw_aes_go_dyn - Run AES Encryption (active high pulse) */
#define BLE2_REG_BLE_REG_AES_CNTRL_SW_AES_GO_DYN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_CNTRL_SW_AES_GO_DYN_SHIFT)) & BLE2_REG_BLE_REG_AES_CNTRL_SW_AES_GO_DYN_MASK)

#define BLE2_REG_BLE_REG_AES_CNTRL_SW_CCM_CLK_REQ_MASK (0x2U)
#define BLE2_REG_BLE_REG_AES_CNTRL_SW_CCM_CLK_REQ_SHIFT (1U)
/*! sw_ccm_clk_req - CCM/AES clock control, 0x0: disable clock for encryption, 0x1: request (enable) clock for encryption */
#define BLE2_REG_BLE_REG_AES_CNTRL_SW_CCM_CLK_REQ(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_CNTRL_SW_CCM_CLK_REQ_SHIFT)) & BLE2_REG_BLE_REG_AES_CNTRL_SW_CCM_CLK_REQ_MASK)

#define BLE2_REG_BLE_REG_AES_CNTRL_SECURE_IRK_DECRYPT_DYN_MASK (0x4U)
#define BLE2_REG_BLE_REG_AES_CNTRL_SECURE_IRK_DECRYPT_DYN_SHIFT (2U)
/*! secure_irk_decrypt_dyn - Decrypt IRK using DKey (active high pulse), When this bit is set; BTU
 *    will descramble the IRKs using DKEY from local store. The scrambled Keys should be written in
 *    BLE_REG_AES_DIN\* registeres and the plain text IRKs will be saved in BLE_REG_AES_DOUT
 *    register. The BLE_REG_AES_KEY\* register are not used in this mode., This bit is self clearing and is
 *    cleared by HW when AES operation is done., Note: Since BTU's AES engine only supports
 *    encryption mode (as purposely chosen for CCM mode); it is agreed with MICRO team that technically the
 *    Sentinel will perform the AES decryption operation to generate the ESK while BTU will carry
 *    out the AES encryption operation to derive the plain text SK. So; at BTU side we do such: SK =
 *    AES-128 Encryp (ESK; DKey_SK) IRK = AES-128 Encryp(EIRK; DKey_IRK) At S200 side; they do such:
 *    ESK = AES-128 Decryp(SK; DKey_SK) EIRK = AES-128 Decryp(IRK; DKey_IRK) So; the functional
 *    process on BTU side is to decrypt to unwrap the SK or IRK; but the actual HW operation is
 *    encryption.
 */
#define BLE2_REG_BLE_REG_AES_CNTRL_SECURE_IRK_DECRYPT_DYN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_CNTRL_SECURE_IRK_DECRYPT_DYN_SHIFT)) & BLE2_REG_BLE_REG_AES_CNTRL_SECURE_IRK_DECRYPT_DYN_MASK)

