zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_AES_CNTRL_LOCK_SW_AES_REGS_MASK (0x80000000U)
#define BLE2_REG_BLE_REG_AES_CNTRL_LOCK_SW_AES_REGS_SHIFT (31U)
/*! lock_sw_aes_regs - Lock Software AES registers from write, 0x0: All 12 Software AES registers
 *    (BLE_REG_AES_KEY_0~3; BLE_REG_AES_DIN_0~3;, BLE_REG_AES_DOUT_0~3) can be written as normal.,
 *    0x1: All 12 Software AES registers are read-only. Software and hardware write to them, is
 *    disabled.
 */
#define BLE2_REG_BLE_REG_AES_CNTRL_LOCK_SW_AES_REGS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_CNTRL_LOCK_SW_AES_REGS_SHIFT)) & BLE2_REG_BLE_REG_AES_CNTRL_LOCK_SW_AES_REGS_MASK)
/*! @} */

/*! @name BLE_REG_AES_KEY_0 - Key 0 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_KEY_0_SW_AES_KEY_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_KEY_0_SW_AES_KEY_SHIFT (0U)
/*! sw_aes_key - AES Key ([31:0] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_KEY_0_SW_AES_KEY(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_KEY_0_SW_AES_KEY_SHIFT)) & BLE2_REG_BLE_REG_AES_KEY_0_SW_AES_KEY_MASK)
/*! @} */

/*! @name BLE_REG_AES_KEY_1 - Key 1 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_KEY_1_SW_AES_KEY_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_KEY_1_SW_AES_KEY_SHIFT (0U)
/*! sw_aes_key - AES Key ([63:32] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_KEY_1_SW_AES_KEY(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_KEY_1_SW_AES_KEY_SHIFT)) & BLE2_REG_BLE_REG_AES_KEY_1_SW_AES_KEY_MASK)
/*! @} */

/*! @name BLE_REG_AES_KEY_2 - Key 2 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_KEY_2_SW_AES_KEY_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_KEY_2_SW_AES_KEY_SHIFT (0U)
/*! sw_aes_key - AES Key ([95:64] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_KEY_2_SW_AES_KEY(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_KEY_2_SW_AES_KEY_SHIFT)) & BLE2_REG_BLE_REG_AES_KEY_2_SW_AES_KEY_MASK)
/*! @} */

/*! @name BLE_REG_AES_KEY_3 - Key 3 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_KEY_3_SW_AES_KEY_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_KEY_3_SW_AES_KEY_SHIFT (0U)
/*! sw_aes_key - AES Key ([127:96] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_KEY_3_SW_AES_KEY(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_KEY_3_SW_AES_KEY_SHIFT)) & BLE2_REG_BLE_REG_AES_KEY_3_SW_AES_KEY_MASK)
/*! @} */

/*! @name BLE_REG_AES_DIN_0 - Raw Data Input 0 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_DIN_0_SW_AES_DIN_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_DIN_0_SW_AES_DIN_SHIFT (0U)
/*! sw_aes_din - Raw Data Input for AES Encryption ([31:0] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_DIN_0_SW_AES_DIN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_DIN_0_SW_AES_DIN_SHIFT)) & BLE2_REG_BLE_REG_AES_DIN_0_SW_AES_DIN_MASK)
/*! @} */

/*! @name BLE_REG_AES_DIN_1 - Raw Data Input 1 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_DIN_1_SW_AES_DIN_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_DIN_1_SW_AES_DIN_SHIFT (0U)
/*! sw_aes_din - Raw Data Input for AES Encryption ([63:32] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_DIN_1_SW_AES_DIN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_DIN_1_SW_AES_DIN_SHIFT)) & BLE2_REG_BLE_REG_AES_DIN_1_SW_AES_DIN_MASK)
/*! @} */

/*! @name BLE_REG_AES_DIN_2 - Raw Data Input 2 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_DIN_2_SW_AES_DIN_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_DIN_2_SW_AES_DIN_SHIFT (0U)
/*! sw_aes_din - Raw Data Input for AES Encryption ([95:64] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_DIN_2_SW_AES_DIN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_DIN_2_SW_AES_DIN_SHIFT)) & BLE2_REG_BLE_REG_AES_DIN_2_SW_AES_DIN_MASK)
/*! @} */

/*! @name BLE_REG_AES_DIN_3 - Raw Data Input 3 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_DIN_3_SW_AES_DIN_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_DIN_3_SW_AES_DIN_SHIFT (0U)
/*! sw_aes_din - Raw Data Input for AES Encryption ([127:96] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_DIN_3_SW_AES_DIN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_DIN_3_SW_AES_DIN_SHIFT)) & BLE2_REG_BLE_REG_AES_DIN_3_SW_AES_DIN_MASK)
/*! @} */

/*! @name BLE_REG_AES_DOUT_0 - AES Encrypted Data Output 0 */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_DOUT_0_SW_AES_DOUT_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_DOUT_0_SW_AES_DOUT_SHIFT (0U)
/*! sw_aes_dout - AES Encrypted Data Output ([31:0] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_DOUT_0_SW_AES_DOUT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_DOUT_0_SW_AES_DOUT_SHIFT)) & BLE2_REG_BLE_REG_AES_DOUT_0_SW_AES_DOUT_MASK)
/*! @} */

/*! @name BLE_REG_AES_DOUT_1 - AES Encrypted Data Output 1 */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_DOUT_1_SW_AES_DOUT_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_DOUT_1_SW_AES_DOUT_SHIFT (0U)
/*! sw_aes_dout - AES Encrypted Data Output ([63:32] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_DOUT_1_SW_AES_DOUT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_DOUT_1_SW_AES_DOUT_SHIFT)) & BLE2_REG_BLE_REG_AES_DOUT_1_SW_AES_DOUT_MASK)
/*! @} */

/*! @name BLE_REG_AES_DOUT_2 - AES Encrypted Data Output 2 */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_DOUT_2_SW_AES_DOUT_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_DOUT_2_SW_AES_DOUT_SHIFT (0U)
/*! sw_aes_dout - AES Encrypted Data Output ([95:64] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_DOUT_2_SW_AES_DOUT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_DOUT_2_SW_AES_DOUT_SHIFT)) & BLE2_REG_BLE_REG_AES_DOUT_2_SW_AES_DOUT_MASK)
/*! @} */

/*! @name BLE_REG_AES_DOUT_3 - AES Encrypted Data Output 3 */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_DOUT_3_SW_AES_DOUT_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_DOUT_3_SW_AES_DOUT_SHIFT (0U)
/*! sw_aes_dout - AES Encrypted Data Output ([127:96] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_DOUT_3_SW_AES_DOUT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_DOUT_3_SW_AES_DOUT_SHIFT)) & BLE2_REG_BLE_REG_AES_DOUT_3_SW_AES_DOUT_MASK)
/*! @} */

/*! @name BLE_REG_INT_MASK_0 - BLE Interrupt Mask 0 */
/*! @{ */

