zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_RX_SYNC_PULSE_TIMEOUT_INTR_STS_MASK (0x20U)
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_RX_SYNC_PULSE_TIMEOUT_INTR_STS_SHIFT (5U)
/*! rx_sync_pulse_timeout_intr_sts - rx_sync_pulse_timeout_intr_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_RX_SYNC_PULSE_TIMEOUT_INTR_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_MASK_RX_SYNC_PULSE_TIMEOUT_INTR_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_MASK_RX_SYNC_PULSE_TIMEOUT_INTR_STS_MASK)

#define BLE2_REG_BLE_REG_HW_ABORT_MASK_RX_DATAVLD_TIMEOUT_INTR_STS_MASK (0x40U)
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_RX_DATAVLD_TIMEOUT_INTR_STS_SHIFT (6U)
/*! rx_datavld_timeout_intr_sts - rx_datavld_timeout_intr_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_RX_DATAVLD_TIMEOUT_INTR_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_MASK_RX_DATAVLD_TIMEOUT_INTR_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_MASK_RX_DATAVLD_TIMEOUT_INTR_STS_MASK)

#define BLE2_REG_BLE_REG_HW_ABORT_MASK_TXRX_ERROR_STS_MASK (0x80U)
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_TXRX_ERROR_STS_SHIFT (7U)
/*! txrx_error_sts - txrx_error_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_TXRX_ERROR_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_MASK_TXRX_ERROR_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_MASK_TXRX_ERROR_STS_MASK)

#define BLE2_REG_BLE_REG_HW_ABORT_MASK_SW_ABORT_B4_A2_STS_MASK (0x100U)
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_SW_ABORT_B4_A2_STS_SHIFT (8U)
/*! sw_abort_b4_a2_sts - sw_abort_b4_a2_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_SW_ABORT_B4_A2_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_MASK_SW_ABORT_B4_A2_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_MASK_SW_ABORT_B4_A2_STS_MASK)

#define BLE2_REG_BLE_REG_HW_ABORT_MASK_SW_ABORT_AFTER_A2_STS_MASK (0x200U)
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_SW_ABORT_AFTER_A2_STS_SHIFT (9U)
/*! sw_abort_after_a2_sts - sw_abort_after_a2_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_SW_ABORT_AFTER_A2_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_MASK_SW_ABORT_AFTER_A2_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_MASK_SW_ABORT_AFTER_A2_STS_MASK)

#define BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_ABORT_STS_MASK (0x400U)
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_ABORT_STS_SHIFT (10U)
/*! ble_cca_abort_sts - ble_cca_abort_sts interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_ABORT_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_ABORT_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_ABORT_STS_MASK)

#define BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_ABORT_THD_MET_STS_MASK (0x800U)
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_ABORT_THD_MET_STS_SHIFT (11U)
/*! ble_cca_abort_thd_met_sts - ble_cca_abort_thd_met interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_ABORT_THD_MET_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_ABORT_THD_MET_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_ABORT_THD_MET_STS_MASK)

#define BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_TXPKT_THD_MET_STS_MASK (0x1000U)
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_TXPKT_THD_MET_STS_SHIFT (12U)
/*! ble_cca_txpkt_thd_met_sts - ble_cca_txpkt_thd_met interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_TXPKT_THD_MET_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_TXPKT_THD_MET_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_MASK_BLE_CCA_TXPKT_THD_MET_STS_MASK)
/*! @} */

/*! @name BLE_REG_RT_ERR_MASK - BLE Interrupt Mask; Real-time Error */
/*! @{ */

#define BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_CUTOFF_INTR_MASK (0x2U)
#define BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_CUTOFF_INTR_SHIFT (1U)
/*! ble_cutoff_intr - ble_cutoff_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_CUTOFF_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_CUTOFF_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_CUTOFF_INTR_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_EXTN_FAIL_INTR_MASK (0x4U)
#define BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_EXTN_FAIL_INTR_SHIFT (2U)
/*! ble_extn_fail_intr - ble_extn_fail_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_EXTN_FAIL_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_EXTN_FAIL_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_EXTN_FAIL_INTR_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_BCACUTOFF_INTR_MASK (0x8U)
#define BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_BCACUTOFF_INTR_SHIFT (3U)
/*! ble_bcacutoff_intr - ble_bcacutoff_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_BCACUTOFF_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_BCACUTOFF_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_MASK_BLE_BCACUTOFF_INTR_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_MASK_COR_TIMEOUT_INTR_MASK (0x10U)
#define BLE2_REG_BLE_REG_RT_ERR_MASK_COR_TIMEOUT_INTR_SHIFT (4U)
/*! cor_timeout_intr - cor_timeout_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_RT_ERR_MASK_COR_TIMEOUT_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_MASK_COR_TIMEOUT_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_MASK_COR_TIMEOUT_INTR_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_MASK_RX_SYNC_PULSE_TIMEOUT_INTR_MASK (0x20U)
#define BLE2_REG_BLE_REG_RT_ERR_MASK_RX_SYNC_PULSE_TIMEOUT_INTR_SHIFT (5U)
/*! rx_sync_pulse_timeout_intr - rx_sync_pulse_timeout_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_RT_ERR_MASK_RX_SYNC_PULSE_TIMEOUT_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_MASK_RX_SYNC_PULSE_TIMEOUT_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_MASK_RX_SYNC_PULSE_TIMEOUT_INTR_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_MASK_RX_DATAVLD_TIMEOUT_INTR_MASK (0x40U)
#define BLE2_REG_BLE_REG_RT_ERR_MASK_RX_DATAVLD_TIMEOUT_INTR_SHIFT (6U)
/*! rx_datavld_timeout_intr - rx_datavld_timeout_intr interrupt, 0x0: disable interrupt, 0x1: enable interrupt */
#define BLE2_REG_BLE_REG_RT_ERR_MASK_RX_DATAVLD_TIMEOUT_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_MASK_RX_DATAVLD_TIMEOUT_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_MASK_RX_DATAVLD_TIMEOUT_INTR_MASK)

