zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_SW_ABORT_B4_A2_STS_MASK (0x100U)
#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_SW_ABORT_B4_A2_STS_SHIFT (8U)
/*! ble_sw_abort_b4_a2_sts - If ble_reg_sw_abort happens during ongoing BLE packet and before dbus A2; ble_sw_abort_b4_a2_sts is issued */
#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_SW_ABORT_B4_A2_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_SW_ABORT_B4_A2_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_SW_ABORT_B4_A2_STS_MASK)

#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_SW_ABORT_AFTER_A2_STS_MASK (0x200U)
#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_SW_ABORT_AFTER_A2_STS_SHIFT (9U)
/*! ble_sw_abort_after_a2_sts - If ble_reg_sw_abort happens while ongoing BLE transaction and after dbus A2; ble_sw_abort_after_a2_sts is issued */
#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_SW_ABORT_AFTER_A2_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_SW_ABORT_AFTER_A2_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_SW_ABORT_AFTER_A2_STS_MASK)

#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_ABORT_STS_MASK (0x400U)
#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_ABORT_STS_SHIFT (10U)
/*! ble_cca_abort_sts - When CCA is enabled on TX; and it results in an abort indication from BRF; ble_cca_abort_sts is issued */
#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_ABORT_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_ABORT_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_ABORT_STS_MASK)

#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_ABORT_THD_MET_STS_MASK (0x800U)
#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_ABORT_THD_MET_STS_SHIFT (11U)
/*! ble_cca_abort_thd_met_sts - Aborts on atleast one channel have met or exceeded the programmed threshold value in ble_cca_abort_pkt_cnt_thd */
#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_ABORT_THD_MET_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_ABORT_THD_MET_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_ABORT_THD_MET_STS_MASK)

#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_TXPKT_THD_MET_STS_MASK (0x1000U)
#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_TXPKT_THD_MET_STS_SHIFT (12U)
/*! ble_cca_txpkt_thd_met_sts - Total CCA TX packets on atleast one channel have met or exceeded the
 *    programmed threshold value in ble_cca_tx_pkt_cnt_thd
 */
#define BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_TXPKT_THD_MET_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_TXPKT_THD_MET_STS_SHIFT)) & BLE2_REG_BLE_REG_HW_ABORT_STS_BLE_CCA_TXPKT_THD_MET_STS_MASK)
/*! @} */

/*! @name BLE_REG_RT_ERR_STS - BLE Interrupt Status; Real-time Error */
/*! @{ */

#define BLE2_REG_BLE_REG_RT_ERR_STS_BLE_CUTOFF_INTR_MASK (0x2U)
#define BLE2_REG_BLE_REG_RT_ERR_STS_BLE_CUTOFF_INTR_SHIFT (1U)
/*! ble_cutoff_intr - ble_cutoff_intr real-time interrupt, RIF ARB has cut off BLE packet. */
#define BLE2_REG_BLE_REG_RT_ERR_STS_BLE_CUTOFF_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_STS_BLE_CUTOFF_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_STS_BLE_CUTOFF_INTR_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_STS_BLE_EXTN_FAIL_INTR_MASK (0x4U)
#define BLE2_REG_BLE_REG_RT_ERR_STS_BLE_EXTN_FAIL_INTR_SHIFT (2U)
/*! ble_extn_fail_intr - ble_extn_fail_intr real-time interrupt, Interrupt indicateds extension was
 *    not sent or received as expected from the following cases:, 1. Hardware abort condition was
 *    detected during extension., 2. BCA deasserted antSwitchStatus signal; meaning it could not honor
 *    the the antenna switching pattern that BLE had requested.
 */
#define BLE2_REG_BLE_REG_RT_ERR_STS_BLE_EXTN_FAIL_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_STS_BLE_EXTN_FAIL_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_STS_BLE_EXTN_FAIL_INTR_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_STS_BLE_BCACUTOFF_INTR_MASK (0x8U)
#define BLE2_REG_BLE_REG_RT_ERR_STS_BLE_BCACUTOFF_INTR_SHIFT (3U)
/*! ble_bcacutoff_intr - ble_bcacutoff_intr real-time interrupt, BCA has cut off BLE packet. */
#define BLE2_REG_BLE_REG_RT_ERR_STS_BLE_BCACUTOFF_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_STS_BLE_BCACUTOFF_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_STS_BLE_BCACUTOFF_INTR_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_STS_COR_TIMEOUT_INTR_MASK (0x10U)
#define BLE2_REG_BLE_REG_RT_ERR_STS_COR_TIMEOUT_INTR_SHIFT (4U)
/*! cor_timeout_intr - cor_timeout_intr real-time interrupt, Correlation timeout condition has occurred. */
#define BLE2_REG_BLE_REG_RT_ERR_STS_COR_TIMEOUT_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_STS_COR_TIMEOUT_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_STS_COR_TIMEOUT_INTR_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_STS_RX_SYNC_PULSE_TIMEOUT_INTR_MASK (0x20U)
#define BLE2_REG_BLE_REG_RT_ERR_STS_RX_SYNC_PULSE_TIMEOUT_INTR_SHIFT (5U)
/*! rx_sync_pulse_timeout_intr - rx_sync_pulse_timeout_intr real-time interrupt, Sync timeout condition has occurred. */
#define BLE2_REG_BLE_REG_RT_ERR_STS_RX_SYNC_PULSE_TIMEOUT_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_STS_RX_SYNC_PULSE_TIMEOUT_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_STS_RX_SYNC_PULSE_TIMEOUT_INTR_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_STS_RX_DATAVLD_TIMEOUT_INTR_MASK (0x40U)
#define BLE2_REG_BLE_REG_RT_ERR_STS_RX_DATAVLD_TIMEOUT_INTR_SHIFT (6U)
/*! rx_datavld_timeout_intr - rx_datavld_timeout_intr real-time interrupt, PDU Rx data valid timeout condition has occurred. Bursting Mode only. */
#define BLE2_REG_BLE_REG_RT_ERR_STS_RX_DATAVLD_TIMEOUT_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_STS_RX_DATAVLD_TIMEOUT_INTR_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_STS_RX_DATAVLD_TIMEOUT_INTR_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_STS_TX_EXTN_ANT_SWITCH_FAIL_STS_MASK (0x100U)
#define BLE2_REG_BLE_REG_RT_ERR_STS_TX_EXTN_ANT_SWITCH_FAIL_STS_SHIFT (8U)
/*! tx_extn_ant_switch_fail_sts - tx_extn_ant_switch_sts interrupt, BCA antSwitchStatus signal deassertion was occurred during extension transmission. */
#define BLE2_REG_BLE_REG_RT_ERR_STS_TX_EXTN_ANT_SWITCH_FAIL_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_STS_TX_EXTN_ANT_SWITCH_FAIL_STS_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_STS_TX_EXTN_ANT_SWITCH_FAIL_STS_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_STS_TX_EXTN_ABORT_STS_MASK (0x200U)
#define BLE2_REG_BLE_REG_RT_ERR_STS_TX_EXTN_ABORT_STS_SHIFT (9U)
/*! tx_extn_abort_sts - tx_extn_abort_sts interrupt, Hardware abort condition other than antenna
 *    switching fail was occurred during extension transmission.
 */
#define BLE2_REG_BLE_REG_RT_ERR_STS_TX_EXTN_ABORT_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_STS_TX_EXTN_ABORT_STS_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_STS_TX_EXTN_ABORT_STS_MASK)

#define BLE2_REG_BLE_REG_RT_ERR_STS_RX_EXTN_ANT_SWITCH_FAIL_STS_MASK (0x400U)
#define BLE2_REG_BLE_REG_RT_ERR_STS_RX_EXTN_ANT_SWITCH_FAIL_STS_SHIFT (10U)
/*! rx_extn_ant_switch_fail_sts - rx_extn_ant_switch_sts interrupt, BCA antSwitchStatus signal deassertion was occurred during extension reception. */
#define BLE2_REG_BLE_REG_RT_ERR_STS_RX_EXTN_ANT_SWITCH_FAIL_STS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RT_ERR_STS_RX_EXTN_ANT_SWITCH_FAIL_STS_SHIFT)) & BLE2_REG_BLE_REG_RT_ERR_STS_RX_EXTN_ANT_SWITCH_FAIL_STS_MASK)

