zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
/*! @name BLE_REG_TMR_SWT_STS_2 - Software Timer 2: Expiration Status */
/*! @{ */

#define BLE2_REG_BLE_REG_TMR_SWT_STS_2_EXPIRY_STATUS_MASK (0x1U)
#define BLE2_REG_BLE_REG_TMR_SWT_STS_2_EXPIRY_STATUS_SHIFT (0U)
/*! expiry_status - Expiry Status, This bit is updated at each expiry. Once set it remains set until
 *    this SWT expires again. For the purpose of this register; past value on SWT refers to a value
 *    up to 12 hours before the current BTC native clock value., 0x0: SWT expired at programmed
 *    value without any errors, 0x1: SWT was programmed for a value that is in the past
 */
#define BLE2_REG_BLE_REG_TMR_SWT_STS_2_EXPIRY_STATUS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_STS_2_EXPIRY_STATUS_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_STS_2_EXPIRY_STATUS_MASK)

#define BLE2_REG_BLE_REG_TMR_SWT_STS_2_SKIP_STATUS_MASK (0x2U)
#define BLE2_REG_BLE_REG_TMR_SWT_STS_2_SKIP_STATUS_SHIFT (1U)
/*! skip_status - Clock skipping Status, This bit is updated each time the LPO version of
 *    nativeClock skips any number of values AND a previously programmed timer expiry got skipped. This is
 *    likely to happen only when BTC is entering sleep state when the LPO version of native clock MAY
 *    be updated with the most accurate value., 0x0: SWT expired at programmed value without any
 *    skipping error, 0x1: Current timer expiry is due to clock skipping over the programmed expiration,
 *    value
 */
#define BLE2_REG_BLE_REG_TMR_SWT_STS_2_SKIP_STATUS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_STS_2_SKIP_STATUS_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_STS_2_SKIP_STATUS_MASK)

#define BLE2_REG_BLE_REG_TMR_SWT_STS_2_SWT_CONF_VALID_MASK (0x4U)
#define BLE2_REG_BLE_REG_TMR_SWT_STS_2_SWT_CONF_VALID_SHIFT (2U)
/*! swt_conf_valid - SWT Configuration Valid Indication, Indicates when SWT configurations are
 *    registered into sleep clock domain Bit is set when configurations are registered in slow domain and
 *    reset at SWT expiry; for both successful expiry as well as past value expiry, 0x0: SWT
 *    configuration is not registered into slow clock domain yet, 0x1: SWT configuration is safely
 *    registered into slow clock domain
 */
#define BLE2_REG_BLE_REG_TMR_SWT_STS_2_SWT_CONF_VALID(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_STS_2_SWT_CONF_VALID_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_STS_2_SWT_CONF_VALID_MASK)
/*! @} */

/*! @name BLE_REG_TMR_SWT_CTL_3 - Software Timer 3: Control */
/*! @{ */

#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_TIMER_EN_MASK (0x1U)
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_TIMER_EN_SHIFT (0U)
/*! timer_en - Set Timer Enable, This bit is self clearing by hardware after timer expires., 0x0: disable timer, 0x1: enable timer */
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_TIMER_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_CTL_3_TIMER_EN_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_CTL_3_TIMER_EN_MASK)

#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_TX_MASK (0x2U)
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_TX_SHIFT (1U)
/*! expiry_emask_tx - Event Mask: Tx, Expiration Event Mask for triggering an Tx transaction., 0x0:
 *    no event, 0x1: Tx event triggered at timer expiry
 */
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_TX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_TX_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_TX_MASK)

#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_RX_MASK (0x4U)
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_RX_SHIFT (2U)
/*! expiry_emask_rx - Event Mask: Rx, Expiration Event Mask for triggering an Rx transaction., 0x0:
 *    no event, 0x1: Rx event triggered at timer expiry
 */
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_RX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_RX_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_RX_MASK)

#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_INTR_MASK (0x8U)
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_INTR_SHIFT (3U)
/*! expiry_emask_intr - Event Mask: Interrupt, Expiration Event Mask for Interrupt, 0x0: no event, 0x1: interrupt triggered at expiry of timer */
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_INTR_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_INTR_MASK)

#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_ABORT_MASK (0x10U)
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_ABORT_SHIFT (4U)
/*! expiry_emask_abort - Event Mask: Abort, Expiration Event Mask for Abort, 0x0: no event, 0x1: Tx/Rx abort triggered at expiry of timer */
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_ABORT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_ABORT_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_ABORT_MASK)

#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_CS_MASK (0x20U)
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_CS_SHIFT (5U)
/*! expiry_emask_cs - Event Mask: CS event for KW PHY, Expiration Event Mask for triggering a CS
 *    transaction to KW PHY, 0x0: no event, 0x1: CS event triggered at timer expiry
 */
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_CS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_CS_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_CTL_3_EXPIRY_EMASK_CS_MASK)

#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_SLOT_MASK_MASK (0xC0U)
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_SLOT_MASK_SHIFT (6U)
/*! slot_mask - Slot Mask, This register is a 2 bit LSB mask on the clock comparator. If both bits
 *    are cleared; then the events will assert regardless of the matching state of the LSB bits.,
 *    frame,0x0: timer works on frame basis, 0x1: invalid, slot,0x2: timer works on slot basis,
 *    halfslot,0x3: timer works on half slot basis
 */
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_SLOT_MASK(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_CTL_3_SLOT_MASK_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_CTL_3_SLOT_MASK_MASK)

#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_ALLOW_CURRENT_EXPIRY_MASK (0x80000000U)
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_ALLOW_CURRENT_EXPIRY_SHIFT (31U)
/*! allow_current_expiry - Allow current SWT expiry with chained CDT; for CDT Matching mode, SWT
 *    configuration for new CDT chaining mode. SWT programming with current native clock values would
 *    be considered valid; past expiry_status won't be set. SWT expiry events like TX; RX; HW Abort;
 *    and CS still cannot be triggered if programming time half slot is <= current native clock. SWT
 *    interrupt will also not get generated at such values (since it is too late). Added for
 *    KFOURWONE-2451, 0x0: SWT is configured in original mode where current native clock value is,
 *    considered to be in the past, 0x1: SWT is configured in new CDT matching mode where current native
 *    clock value is, allowed to trigger chained CDTs
 */
#define BLE2_REG_BLE_REG_TMR_SWT_CTL_3_ALLOW_CURRENT_EXPIRY(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_CTL_3_ALLOW_CURRENT_EXPIRY_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_CTL_3_ALLOW_CURRENT_EXPIRY_MASK)
/*! @} */

/*! @name BLE_REG_TMR_SWT_VALUE_3 - Software Timer 3: Expiration Value */
/*! @{ */

#define BLE2_REG_BLE_REG_TMR_SWT_VALUE_3_EXPIRY_VALUE_MASK (0xFFFFFFFU)
#define BLE2_REG_BLE_REG_TMR_SWT_VALUE_3_EXPIRY_VALUE_SHIFT (0U)
/*! expiry_value - Expiry Value, Bluetooth native clock value for event generation. When the
 *    Bluetooth native clock equals this value; the events are triggered.
 */
#define BLE2_REG_BLE_REG_TMR_SWT_VALUE_3_EXPIRY_VALUE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_VALUE_3_EXPIRY_VALUE_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_VALUE_3_EXPIRY_VALUE_MASK)
/*! @} */

/*! @name BLE_REG_TMR_SWT_STS_3 - Software Timer 3: Expiration Status */
/*! @{ */

#define BLE2_REG_BLE_REG_TMR_SWT_STS_3_EXPIRY_STATUS_MASK (0x1U)
#define BLE2_REG_BLE_REG_TMR_SWT_STS_3_EXPIRY_STATUS_SHIFT (0U)
/*! expiry_status - Expiry Status, This bit is updated at each expiry. Once set it remains set until
 *    this SWT expires again. For the purpose of this register; past value on SWT refers to a value
 *    up to 12 hours before the current BTC native clock value., 0x0: SWT expired at programmed
 *    value without any errors, 0x1: SWT was programmed for a value that is in the past
 */
#define BLE2_REG_BLE_REG_TMR_SWT_STS_3_EXPIRY_STATUS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_STS_3_EXPIRY_STATUS_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_STS_3_EXPIRY_STATUS_MASK)

