zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_TMR_SWT_STS_3_SKIP_STATUS_MASK (0x2U)
#define BLE2_REG_BLE_REG_TMR_SWT_STS_3_SKIP_STATUS_SHIFT (1U)
/*! skip_status - Clock skipping Status, This bit is updated each time the LPO version of
 *    nativeClock skips any number of values AND a previously programmed timer expiry got skipped. This is
 *    likely to happen only when BTC is entering sleep state when the LPO version of native clock MAY
 *    be updated with the most accurate value., 0x0: SWT expired at programmed value without any
 *    skipping error, 0x1: Current timer expiry is due to clock skipping over the programmed expiration,
 *    value
 */
#define BLE2_REG_BLE_REG_TMR_SWT_STS_3_SKIP_STATUS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_STS_3_SKIP_STATUS_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_STS_3_SKIP_STATUS_MASK)

#define BLE2_REG_BLE_REG_TMR_SWT_STS_3_SWT_CONF_VALID_MASK (0x4U)
#define BLE2_REG_BLE_REG_TMR_SWT_STS_3_SWT_CONF_VALID_SHIFT (2U)
/*! swt_conf_valid - SWT Configuration Valid Indication, Indicates when SWT configurations are
 *    registered into sleep clock domain Bit is set when configurations are registered in slow domain and
 *    reset at SWT expiry; for both successful expiry as well as past value expiry, 0x0: SWT
 *    configuration is not registered into slow clock domain yet, 0x1: SWT configuration is safely
 *    registered into slow clock domain
 */
#define BLE2_REG_BLE_REG_TMR_SWT_STS_3_SWT_CONF_VALID(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_SWT_STS_3_SWT_CONF_VALID_SHIFT)) & BLE2_REG_BLE_REG_TMR_SWT_STS_3_SWT_CONF_VALID_MASK)
/*! @} */

/*! @name BLE_REG_TMR_NATIVE_QUS - Native quarter microsecond counter Value */
/*! @{ */

#define BLE2_REG_BLE_REG_TMR_NATIVE_QUS_NAT_CLOCK_SLEEP_MASK (0x7FFU)
#define BLE2_REG_BLE_REG_TMR_NATIVE_QUS_NAT_CLOCK_SLEEP_SHIFT (0U)
/*! nat_clock_sleep - Native quarter microsecond counter Value, This is the quarter miscrosecond
 *    timer for FW to read back. The value normally is between 0 to 1249; but it may overflow from this
 *    range in sleep mode. This is a read-only register.
 */
#define BLE2_REG_BLE_REG_TMR_NATIVE_QUS_NAT_CLOCK_SLEEP(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_NATIVE_QUS_NAT_CLOCK_SLEEP_SHIFT)) & BLE2_REG_BLE_REG_TMR_NATIVE_QUS_NAT_CLOCK_SLEEP_MASK)

#define BLE2_REG_BLE_REG_TMR_NATIVE_QUS_NAT_CLOCK_SYS_VALID_MASK (0x80000000U)
#define BLE2_REG_BLE_REG_TMR_NATIVE_QUS_NAT_CLOCK_SYS_VALID_SHIFT (31U)
/*! nat_clock_sys_valid - Status bit for Native Clock Value after wakeup , This status bit indicates
 *    that the Bluetooth native clock value in BLE_REG_TMR_NATIVE_CLOCK is a valid value after
 *    wakeup from SLEEP. SW may read this status bit to confirm that the native clock value read
 *    immediately after wakeup is not a stale value. Reset value is zero. This status is set to 0x1
 *    whenever sleep clock value is captured in sysclk. Reset to 0x0 during SLEEP entry as soon as
 *    ble_clk_req de-asserts indcating a stale value in BLE_REG_TMR_NATIVE_CLOCK.
 */
#define BLE2_REG_BLE_REG_TMR_NATIVE_QUS_NAT_CLOCK_SYS_VALID(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_NATIVE_QUS_NAT_CLOCK_SYS_VALID_SHIFT)) & BLE2_REG_BLE_REG_TMR_NATIVE_QUS_NAT_CLOCK_SYS_VALID_MASK)
/*! @} */

/*! @name BLE_REG_TMR_NATIVE_CLOCK - Native mcClock Value */
/*! @{ */

#define BLE2_REG_BLE_REG_TMR_NATIVE_CLOCK_NAT_CLOCK_SLEEP_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_TMR_NATIVE_CLOCK_NAT_CLOCK_SLEEP_SHIFT (0U)
/*! nat_clock_sleep - Native Clock Value, Bluetooth native clock value used for timer comparison.
 *    This is the sleep clock version of the Bluetooth native clock. To read-verify after a write; it
 *    takes at least 2 sleep clock cycles for the write value to return.
 */
#define BLE2_REG_BLE_REG_TMR_NATIVE_CLOCK_NAT_CLOCK_SLEEP(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_NATIVE_CLOCK_NAT_CLOCK_SLEEP_SHIFT)) & BLE2_REG_BLE_REG_TMR_NATIVE_CLOCK_NAT_CLOCK_SLEEP_MASK)
/*! @} */

/*! @name BLE_REG_TMR_WAKEUP_DELAY_LPO_CYCLES - Wakeup delay value in LPO cycles */
/*! @{ */

#define BLE2_REG_BLE_REG_TMR_WAKEUP_DELAY_LPO_CYCLES_WAKEUP_DELAY_LPO_CYCLES_MASK (0x3FU)
#define BLE2_REG_BLE_REG_TMR_WAKEUP_DELAY_LPO_CYCLES_WAKEUP_DELAY_LPO_CYCLES_SHIFT (0U)
/*! wakeup_delay_lpo_cycles - Wakeup delay in LPO cycles, Number of LPO (sleep clock) cycles from
 *    btu_clk_req assertion until the clocks are stable. The minimum recommended value is 2
 */
#define BLE2_REG_BLE_REG_TMR_WAKEUP_DELAY_LPO_CYCLES_WAKEUP_DELAY_LPO_CYCLES(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_WAKEUP_DELAY_LPO_CYCLES_WAKEUP_DELAY_LPO_CYCLES_SHIFT)) & BLE2_REG_BLE_REG_TMR_WAKEUP_DELAY_LPO_CYCLES_WAKEUP_DELAY_LPO_CYCLES_MASK)
/*! @} */

/*! @name BLE_REG_TMR_CLOCK_SKIP - Native Clock Value */
/*! @{ */

#define BLE2_REG_BLE_REG_TMR_CLOCK_SKIP_OLD_NATIVE_CLOCK_MASK (0xFFU)
#define BLE2_REG_BLE_REG_TMR_CLOCK_SKIP_OLD_NATIVE_CLOCK_SHIFT (0U)
/*! old_native_clock - Native Clock Value (before skip), Bluetooth native clock value before the
 *    clock skip was observed. The value after skip can be read in the BLE_REG_TMR_NATIVE_CLOCK
 *    register.
 */
#define BLE2_REG_BLE_REG_TMR_CLOCK_SKIP_OLD_NATIVE_CLOCK(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CLOCK_SKIP_OLD_NATIVE_CLOCK_SHIFT)) & BLE2_REG_BLE_REG_TMR_CLOCK_SKIP_OLD_NATIVE_CLOCK_MASK)
/*! @} */

/*! @name BLE_REG_TMR_CDT_CTL_0 - Qus Count Down Timer 0: Control */
/*! @{ */

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_INTR_MASK (0x1U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_INTR_SHIFT (0U)
/*! expiry_emask_intr - Event Mask: Interrupt, Expiration Event Mask for Interrupt, 0x0: no event, 0x1: interrupt triggered at expiry of timer */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_INTR_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_INTR_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_TX_MASK (0x2U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_TX_SHIFT (1U)
/*! expiry_emask_tx - Event Mask: Tx, Expiration Event Mask for triggering an Tx transaction., 0x0:
 *    no event, 0x1: Tx event triggered at timer expiry
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_TX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_TX_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_TX_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_RX_MASK (0x4U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_RX_SHIFT (2U)
/*! expiry_emask_rx - Event Mask: Rx, Expiration Event Mask for triggering an Rx transaction., 0x0:
 *    no event, 0x1: Rx event triggered at timer expiry
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_RX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_RX_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_RX_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_ABORT_MASK (0x8U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_ABORT_SHIFT (3U)
/*! expiry_emask_abort - Event Mask: Abort, Expiration Event Mask for triggering an Abort from
 *    software., 0x0: no event, 0x1: Abort triggered at timer expiry
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_ABORT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_ABORT_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_0_EXPIRY_EMASK_ABORT_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_TXSTART_MASK (0x10U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_TXSTART_SHIFT (4U)
/*! start_emask_ble_txstart - Event Mask: BLE Tx start, Start Event Mask for triggering the CDT
 *    counter. Start counting at the beginning of a BLE Tx transaction., 0x0: no event, 0x1: timer
 *    starts counting down from programmed value at start of next BLE Tx, transaction
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_TXSTART(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_TXSTART_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_TXSTART_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_RXSTART_MASK (0x20U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_RXSTART_SHIFT (5U)
/*! start_emask_ble_rxstart - Event Mask: BLE Rx start, Start Event Mask for triggering the CDT
 *    counter. Start counting at the beginning of a BLE Rx transaction., 0x0: no event, 0x1: timer
 *    starts counting down from programmed value at start of next BLE Rx, transaction
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_RXSTART(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_RXSTART_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_RXSTART_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_TXEND_MASK (0x40U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_TXEND_SHIFT (6U)
/*! start_emask_ble_txend - Event Mask: BLE Tx end, Start Event Mask for triggering the CDT counter.
 *    Start counting at the end of a BLE Tx transaction., 0x0: no event, 0x1: timer starts counting
 *    down from programmed value at end of next BLE Tx, transaction
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_TXEND(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_TXEND_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_TXEND_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_RXEND_MASK (0x80U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_RXEND_SHIFT (7U)
/*! start_emask_ble_rxend - Event Mask: BLE Rx end, Start Event Mask for triggering the CDT counter.
 *    Start counting at the end of a BLE Rx transaction., 0x0: no event, 0x1: timer starts counting
 *    down from programmed value at end of next BLE Rx, transaction
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_RXEND(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_RXEND_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_RXEND_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BTC_PKTEND_MASK (0x100U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BTC_PKTEND_SHIFT (8U)
/*! start_emask_btc_pktend - Event Mask: BTC PKT end, Start Event Mask for triggering the CDT
 *    counter. Start counting at the end of a BTC Tx or Rx transaction., 0x0: no event, 0x1: timer starts
 *    counting down from programmed value at end of next BTC packet (Tx, or Rx) transaction
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BTC_PKTEND(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BTC_PKTEND_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BTC_PKTEND_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_CORRHIT_MASK (0x200U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_CORRHIT_SHIFT (9U)
/*! start_emask_ble_corrhit - Event Mask: BLE CORR hit, Start Event Mask for triggering the CDT
 *    counter. Start counting at BLE correlation hit., 0x0: no event, 0x1: timer starts counting down
 *    from programmed value at next BLE correlation hit
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_CORRHIT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_CORRHIT_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_0_START_EMASK_BLE_CORRHIT_MASK)

