zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_1_CDT_MATCHING_MODE_MASK (0x20000000U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_1_CDT_MATCHING_MODE_SHIFT (29U)
/*! cdt_matching_mode - CDT Matching Mode enable, indicates CDT value is not a countdown value; but
 *    an absolute value to be matched with the timestamp_qus_cnt_4m counter. Added for
 *    KFOURWONE-2451, 0x0: CDT is configured in original Countdown Mode, 0x1: CDT is configured in Matching Mode
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_1_CDT_MATCHING_MODE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_1_CDT_MATCHING_MODE_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_1_CDT_MATCHING_MODE_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_1_EXPIRY_EMASK_CS_MASK (0x40000000U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_1_EXPIRY_EMASK_CS_SHIFT (30U)
/*! expiry_emask_cs - Event Mask: CS event for KW PHY, Expiration Event Mask for triggering a CS
 *    transaction to KW PHY., 0x0: no event, 0x1: CS event triggered at timer expiry
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_1_EXPIRY_EMASK_CS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_1_EXPIRY_EMASK_CS_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_1_EXPIRY_EMASK_CS_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_1_CDT_ADJ_EN_MASK (0x80000000U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_1_CDT_ADJ_EN_SHIFT (31U)
/*! cdt_adj_en - CDT timing adjustment enable, CDT timing adjustment enable for BLE 2M and BLE LR
 *    Tx/Rx for CI = 2;8., 0x0: disable, 0x1: enable
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_1_CDT_ADJ_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_1_CDT_ADJ_EN_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_1_CDT_ADJ_EN_MASK)
/*! @} */

/*! @name BLE_REG_TMR_CDT_VALUE_1 - Count Down Timer 1: Count Value */
/*! @{ */

#define BLE2_REG_BLE_REG_TMR_CDT_VALUE_1_COUNTDOWN_VALUE_MASK (0x1FFFU)
#define BLE2_REG_BLE_REG_TMR_CDT_VALUE_1_COUNTDOWN_VALUE_SHIFT (0U)
/*! countdown_value - Count Down Value, Number of quarter microseconds to count down from. Range is 1 to 8152 qus. */
#define BLE2_REG_BLE_REG_TMR_CDT_VALUE_1_COUNTDOWN_VALUE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_VALUE_1_COUNTDOWN_VALUE_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_VALUE_1_COUNTDOWN_VALUE_MASK)
/*! @} */

/*! @name BLE_REG_TMR_CDT_CTL_2 - Qus Count Down Timer 2: Control */
/*! @{ */

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_INTR_MASK (0x1U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_INTR_SHIFT (0U)
/*! expiry_emask_intr - Event Mask: Interrupt, Expiration Event Mask for Interrupt, 0x0: no event, 0x1: interrupt triggered at expiry of timer */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_INTR_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_INTR_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_TX_MASK (0x2U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_TX_SHIFT (1U)
/*! expiry_emask_tx - Event Mask: Tx, Expiration Event Mask for triggering an Tx transaction., 0x0:
 *    no event, 0x1: Tx event triggered at timer expiry
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_TX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_TX_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_TX_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_RX_MASK (0x4U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_RX_SHIFT (2U)
/*! expiry_emask_rx - Event Mask: Rx, Expiration Event Mask for triggering an Rx transaction., 0x0:
 *    no event, 0x1: Rx event triggered at timer expiry
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_RX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_RX_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_RX_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_ABORT_MASK (0x8U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_ABORT_SHIFT (3U)
/*! expiry_emask_abort - Event Mask: Abort, Expiration Event Mask for triggering an Abort from
 *    software., 0x0: no event, 0x1: Abort triggered at timer expiry
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_ABORT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_ABORT_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_2_EXPIRY_EMASK_ABORT_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_TXSTART_MASK (0x10U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_TXSTART_SHIFT (4U)
/*! start_emask_ble_txstart - Event Mask: BLE Tx start, Start Event Mask for triggering the CDT
 *    counter. Start counting at the beginning of a BLE Tx transaction., 0x0: no event, 0x1: timer
 *    starts counting down from programmed value at start of next BLE Tx, transaction
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_TXSTART(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_TXSTART_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_TXSTART_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_RXSTART_MASK (0x20U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_RXSTART_SHIFT (5U)
/*! start_emask_ble_rxstart - Event Mask: BLE Rx start, Start Event Mask for triggering the CDT
 *    counter. Start counting at the beginning of a BLE Rx transaction., 0x0: no event, 0x1: timer
 *    starts counting down from programmed value at start of next BLE Rx, transaction
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_RXSTART(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_RXSTART_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_RXSTART_MASK)

#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_TXEND_MASK (0x40U)
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_TXEND_SHIFT (6U)
/*! start_emask_ble_txend - Event Mask: BLE Tx end, Start Event Mask for triggering the CDT counter.
 *    Start counting at the end of a BLE Tx transaction., 0x0: no event, 0x1: timer starts counting
 *    down from programmed value at end of next BLE Tx, transaction
 */
#define BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_TXEND(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_TXEND_SHIFT)) & BLE2_REG_BLE_REG_TMR_CDT_CTL_2_START_EMASK_BLE_TXEND_MASK)

