zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_0_MASK (0x1FU)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_0_SHIFT (0U)
/*! tx_ant_switch_index_0 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_0(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_0_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_0_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_1_MASK (0x1F00U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_1_SHIFT (8U)
/*! tx_ant_switch_index_1 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_1(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_1_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_1_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_2_MASK (0x1F0000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_2_SHIFT (16U)
/*! tx_ant_switch_index_2 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_2(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_2_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_2_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_3_MASK (0x1F000000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_3_SHIFT (24U)
/*! tx_ant_switch_index_3 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_3(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_3_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_2_TX_ANT_SWITCH_INDEX_3_MASK)
/*! @} */

/*! @name BLE_REG_ANT_SWITCH_TX_MAP_3 - Tx Antenna Switch Map: Map 3 */
/*! @{ */

#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_0_MASK (0x1FU)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_0_SHIFT (0U)
/*! tx_ant_switch_index_0 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_0(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_0_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_0_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_1_MASK (0x1F00U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_1_SHIFT (8U)
/*! tx_ant_switch_index_1 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_1(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_1_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_1_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_2_MASK (0x1F0000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_2_SHIFT (16U)
/*! tx_ant_switch_index_2 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_2(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_2_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_2_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_3_MASK (0x1F000000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_3_SHIFT (24U)
/*! tx_ant_switch_index_3 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_3(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_3_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_3_TX_ANT_SWITCH_INDEX_3_MASK)
/*! @} */

/*! @name BLE_REG_ANT_SWITCH_TX_MAP_4 - Tx Antenna Switch Map: Map 4 */
/*! @{ */

