zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
/*! @name BLE_REG_ANT_SWITCH_TX_MAP_9 - Tx Antenna Switch Map: Map 9 */
/*! @{ */

#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_0_MASK (0x1FU)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_0_SHIFT (0U)
/*! tx_ant_switch_index_0 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_0(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_0_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_0_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_1_MASK (0x1F00U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_1_SHIFT (8U)
/*! tx_ant_switch_index_1 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_1(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_1_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_1_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_2_MASK (0x1F0000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_2_SHIFT (16U)
/*! tx_ant_switch_index_2 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_2(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_2_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_2_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_3_MASK (0x1F000000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_3_SHIFT (24U)
/*! tx_ant_switch_index_3 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order
 *    of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined
 *    by tx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_3(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_3_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_TX_MAP_9_TX_ANT_SWITCH_INDEX_3_MASK)
/*! @} */

/*! @name BLE_REG_ANT_SWITCH_RX_CNTRL - Rx Antenna Switch Control, Control register of Bluetooth Rx antenna switching. */
/*! @{ */

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_DELAY_1M_MASK (0xFFU)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_DELAY_1M_SHIFT (0U)
/*! rx_ant_switch_delay_1m - Antenna Switch Delay from start of Rx Crc, Timer delayed from start of
 *    CRC of the current Rx packet to start driving requestAntenna to signal BCA which antenna is
 *    used for the expected Rx extension field., - Resolution: 0.25 usec.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_DELAY_1M(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_DELAY_1M_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_DELAY_1M_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_DELAY_2M_MASK (0xFF00U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_DELAY_2M_SHIFT (8U)
/*! rx_ant_switch_delay_2m - Antenna Switch Delay from start of Rx Crc, Timer delayed from start of
 *    CRC of the current Rx packet to start driving requestAntenna to signal BCA which antenna is
 *    used for the expected Rx extension field. This delay is for BLE Rx 2 Mbps., - Resolution: 0.25
 *    usec.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_DELAY_2M(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_DELAY_2M_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_DELAY_2M_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_MAP_LENGTH_MASK (0x3F0000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_MAP_LENGTH_SHIFT (16U)
/*! rx_ant_map_length - Antenna Switch Map Length for Rx DFE, - Valid length of Rx antenna map
 *    pattern (max: 40). After executing the antenna switching for this length; BLE will repeat the
 *    pattern from the beginning. The map is used when BLE is receiving extension packets.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_MAP_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_MAP_LENGTH_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_MAP_LENGTH_MASK)

