zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_RATE_MASK (0xC00000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_RATE_SHIFT (22U)
/*! rx_ant_switch_rate - Antenna Switch Rate, Define the antenna switching rate for extension
 *    packet., 0x0: switch antenna every 4 usec, 0x1: switch antenna every 2 usec, 0x2: switch antenna
 *    every 1 usec (RFU), 0x3: not valid
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_RATE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_RATE_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_RATE_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_REF_ANT_MASK (0x1F000000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_REF_ANT_SHIFT (24U)
/*! ref_ant - BCA reference antenna, The value of reference antenna held by BCA. */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_REF_ANT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_REF_ANT_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_REF_ANT_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_EN_MASK (0x80000000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_EN_SHIFT (31U)
/*! rx_ant_switch_en - Antenna Switch Enable for Rx DFE, Switch antenna for extension when receiving
 *    location packet., 0x0: disable antenna switch for Rx DFE, 0x1: enable antenna switch for Rx
 *    DFE
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_EN_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_CNTRL_RX_ANT_SWITCH_EN_MASK)
/*! @} */

/*! @name BLE_REG_ANT_SWITCH_RX_MAP_0 - Rx Antenna Switch Map: Map 0 */
/*! @{ */

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_0_MASK (0x1FU)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_0_SHIFT (0U)
/*! rx_ant_switch_index_0 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order
 *    of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined
 *    by rx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_0(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_0_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_0_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_1_MASK (0x1F00U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_1_SHIFT (8U)
/*! rx_ant_switch_index_1 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order
 *    of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined
 *    by rx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_1(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_1_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_1_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_2_MASK (0x1F0000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_2_SHIFT (16U)
/*! rx_ant_switch_index_2 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order
 *    of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined
 *    by rx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_2(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_2_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_2_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_3_MASK (0x1F000000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_3_SHIFT (24U)
/*! rx_ant_switch_index_3 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order
 *    of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined
 *    by rx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_3(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_3_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_0_RX_ANT_SWITCH_INDEX_3_MASK)
/*! @} */

/*! @name BLE_REG_ANT_SWITCH_RX_MAP_1 - Rx Antenna Switch Map: Map 1 */
/*! @{ */

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_0_MASK (0x1FU)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_0_SHIFT (0U)
/*! rx_ant_switch_index_0 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order
 *    of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined
 *    by rx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_0(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_0_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_0_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_1_MASK (0x1F00U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_1_SHIFT (8U)
/*! rx_ant_switch_index_1 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order
 *    of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined
 *    by rx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_1(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_1_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_1_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_2_MASK (0x1F0000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_2_SHIFT (16U)
/*! rx_ant_switch_index_2 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order
 *    of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined
 *    by rx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_2(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_2_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_2_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_3_MASK (0x1F000000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_3_SHIFT (24U)
/*! rx_ant_switch_index_3 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order
 *    of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined
 *    by rx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_3(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_3_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_1_RX_ANT_SWITCH_INDEX_3_MASK)
/*! @} */

/*! @name BLE_REG_ANT_SWITCH_RX_MAP_2 - Rx Antenna Switch Map: Map 2 */
/*! @{ */

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_0_MASK (0x1FU)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_0_SHIFT (0U)
/*! rx_ant_switch_index_0 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order
 *    of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined
 *    by rx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_0(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_0_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_0_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_1_MASK (0x1F00U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_1_SHIFT (8U)
/*! rx_ant_switch_index_1 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order
 *    of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined
 *    by rx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_1(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_1_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_1_MASK)

#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_2_MASK (0x1F0000U)
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_2_SHIFT (16U)
/*! rx_ant_switch_index_2 - Antenna Switch Map, Antenna switch map is programmed in a group of 10;
 *    32-bit registers; which represents 40 different values; each value being 5-bit wide for 32
 *    antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order
 *    of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with
 *    the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined
 *    by rx_ant_map_length.
 */
#define BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_2(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_2_SHIFT)) & BLE2_REG_BLE_REG_ANT_SWITCH_RX_MAP_2_RX_ANT_SWITCH_INDEX_2_MASK)

