zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_RESET_CCM_CTL_MASK (0x80U)
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_RESET_CCM_CTL_SHIFT (7U)
/*! reset_ccm_ctl - reset the 2 state machines in ble_ccm_ctl, To reset both rx_pld_blk_rdy_st and
 *    ccm_ctl_st state machines back to Idle state; firmware first writes 1 and then writes 0 to this
 *    bit.
 */
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_RESET_CCM_CTL(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_RESET_CCM_CTL_SHIFT)) & BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_RESET_CCM_CTL_MASK)

#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_ARB_ST_MASK (0x300U)
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_ARB_ST_SHIFT (8U)
/*! arb_st - arb_st value, Current value of btu_aes_arbiter state machine arb_st. */
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_ARB_ST(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_ARB_ST_SHIFT)) & BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_ARB_ST_MASK)

#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_CCM_ST_MASK (0x3000U)
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_CCM_ST_SHIFT (12U)
/*! ccm_st - ccm_st value, Current value of btu_ccm state machine ccm_st. */
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_CCM_ST(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_CCM_ST_SHIFT)) & BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_CCM_ST_MASK)

#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_RESET_BTU_CCM_AES_MASK (0x8000U)
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_RESET_BTU_CCM_AES_SHIFT (15U)
/*! reset_btu_ccm_aes - reset the 2 state machines in ble_ccm_aes, To reset both arb_st and ccm_st
 *    state machines back to Idle state; firmware first writes 1 and then writes 0 to this bit.
 */
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_RESET_BTU_CCM_AES(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_RESET_BTU_CCM_AES_SHIFT)) & BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_RESET_BTU_CCM_AES_MASK)

#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_AES0_ARB_ST_MASK (0x30000U)
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_AES0_ARB_ST_SHIFT (16U)
/*! aes0_arb_st - aes0_arb_st, Current value of the hw aes arbiter state machine aes0_arb_st. */
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_AES0_ARB_ST(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_AES0_ARB_ST_SHIFT)) & BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_AES0_ARB_ST_MASK)

#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_AES1_ARB_ST_MASK (0x300000U)
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_AES1_ARB_ST_SHIFT (20U)
/*! aes1_arb_st - aes1_arb_st, Current value of the sw aes arbiter state machine aes1_arb_st. */
#define BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_AES1_ARB_ST(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_AES1_ARB_ST_SHIFT)) & BLE2_REG_BLE_REG_CCM_FSM_MON_CNTRL_AES1_ARB_ST_MASK)
/*! @} */

/*! @name BLE_REG_DEBUG_CNTRL - BLE Debug Test Bus Control */
/*! @{ */

#define BLE2_REG_BLE_REG_DEBUG_CNTRL_TESTBUS_CNTRL_MASK (0xFU)
#define BLE2_REG_BLE_REG_DEBUG_CNTRL_TESTBUS_CNTRL_SHIFT (0U)
/*! testbus_cntrl - BLE debug test bus output control, BLE testbus swapping control. */
#define BLE2_REG_BLE_REG_DEBUG_CNTRL_TESTBUS_CNTRL(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DEBUG_CNTRL_TESTBUS_CNTRL_SHIFT)) & BLE2_REG_BLE_REG_DEBUG_CNTRL_TESTBUS_CNTRL_MASK)

#define BLE2_REG_BLE_REG_DEBUG_CNTRL_BLE_AHB_MON_SEL_MASK (0x70U)
#define BLE2_REG_BLE_REG_DEBUG_CNTRL_BLE_AHB_MON_SEL_SHIFT (4U)
/*! ble_ahb_mon_sel - BLE AHB Master Debug Signals Selection, BLE AHB Master Debug Signals
 *    Selection, Select BLE AHB Data Bus, 0x0: hRdData[7:0], 0x1: hRdData[15:8], 0x2: hRdData[23:16], 0x3:
 *    hRdData[31:24], 0x4: hWrData[7:0], 0x5: hWrData[15:8], 0x6: hWrData[23:16], 0x7: hWrData[31:24]
 */
#define BLE2_REG_BLE_REG_DEBUG_CNTRL_BLE_AHB_MON_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DEBUG_CNTRL_BLE_AHB_MON_SEL_SHIFT)) & BLE2_REG_BLE_REG_DEBUG_CNTRL_BLE_AHB_MON_SEL_MASK)
/*! @} */

/*! @name BLE_REG_DEBUG_BANK_SEL - BLE debug test bus bank selection set */
/*! @{ */

#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_1_MASK (0xFFU)
#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_1_SHIFT (0U)
/*! testbus_bank_select_1 - BLE debug test bus selection [3:0] */
#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_1(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_1_SHIFT)) & BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_1_MASK)

#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_2_MASK (0xFF00U)
#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_2_SHIFT (8U)
/*! testbus_bank_select_2 - BLE debug test bus selection [7:4] */
#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_2(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_2_SHIFT)) & BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_2_MASK)

#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_3_MASK (0xFF0000U)
#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_3_SHIFT (16U)
/*! testbus_bank_select_3 - BLE debug test bus selection [11:8] */
#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_3(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_3_SHIFT)) & BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_3_MASK)

#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_4_MASK (0xFF000000U)
#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_4_SHIFT (24U)
/*! testbus_bank_select_4 - BLE debug test bus selection [15:12] */
#define BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_4(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_4_SHIFT)) & BLE2_REG_BLE_REG_DEBUG_BANK_SEL_TESTBUS_BANK_SELECT_4_MASK)
/*! @} */

/*! @name BLE_REG_IP_REVISION - BTU IP Revision */
/*! @{ */

#define BLE2_REG_BLE_REG_IP_REVISION_BTU_IP_REV_MASK (0xFFFFU)
#define BLE2_REG_BLE_REG_IP_REVISION_BTU_IP_REV_SHIFT (0U)
/*! btu_ip_rev - BLE IP Revision, Bits[15:8] = major revision number (incremented at full tapeout),
 *    Bits[7:0] = minor revision number (incremented at post tapeout ECO), 88W8787 (Robin) = 0x0800
 *    88W8790 (uBB) = 0x0800 88W8797 (Starling) = 0x900 88W8766 (Geagle) = 0x0900 88W8897 (Kfisher)
 *    = 0x1100 88W8777 (Robin2) = 0x1200 88W8887 (CardiAC) = 0x1300 8830 (Sunbird/BTHM) = 0x1400
 *    88W8977 (Robin3/BTU2) = 0x1600 88W8997 (Kfisher2/BTU2) = 0x1700 88W8987 (Cardi2/BTU2) = 0x1700
 *    88W9064 (SCBT/BTU2) = 0x2100 88W9098 (Skyhawk/BTU2) = 0x2200 88W9000 (Kestrel/BTU2) = 0x2400
 *    88W8978 (Robin3P/BTU2) = 0x2500 Firecrest/BTU2 = 0x2700 K4W1 (NBU/BTU2) = 0x2800
 *    Redfinch/BLE_only = 0x2600 Owl/BTU2 = 0x2900 Tasman/BLE_only = 0x3000 Kamet/BTU2 = 0x3100 Blackbird/BTU2 =
 *    0x3200 KW47 (NBU/BTU2) = 0x3400 Hood/BTU2 = 0x3500 Fuji (NBU/BTU2) = 0x3600 MW30 (NBU/BTU2) =
 *    0x3400
 */
#define BLE2_REG_BLE_REG_IP_REVISION_BTU_IP_REV(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IP_REVISION_BTU_IP_REV_SHIFT)) & BLE2_REG_BLE_REG_IP_REVISION_BTU_IP_REV_MASK)
/*! @} */

/*! @name BLE_REG_AES_MARGIN - BLE AES Margin */
/*! @{ */

