zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_TXN_MAX_MASK (0xFF00U)
#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_TXN_MAX_SHIFT (8U)
/*! ble_mst_txn_max - ble_mst_txn_max, Maximum BLE master transaction latency in number of HCLK cycles */
#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_TXN_MAX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_TXN_MAX_SHIFT)) & BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_TXN_MAX_MASK)

#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_ARB_MAX_MASK (0xFF0000U)
#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_ARB_MAX_SHIFT (16U)
/*! ble_mst_arb_max - ble_mst_arb_max, Maximum BLE master arbitration latency in number of HCLK cycles */
#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_ARB_MAX(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_ARB_MAX_SHIFT)) & BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_ARB_MAX_MASK)

#define BLE2_REG_BLE_REG_AHB_LAT_BLE_SLV_TXN_EN_MASK (0x20000000U)
#define BLE2_REG_BLE_REG_AHB_LAT_BLE_SLV_TXN_EN_SHIFT (29U)
/*! ble_slv_txn_en - ble_slv_txn__en, Enable BLE slave transaction latency monitor. When disabled; the maximum latency is reset to 0 */
#define BLE2_REG_BLE_REG_AHB_LAT_BLE_SLV_TXN_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AHB_LAT_BLE_SLV_TXN_EN_SHIFT)) & BLE2_REG_BLE_REG_AHB_LAT_BLE_SLV_TXN_EN_MASK)

#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_TXN_EN_MASK (0x40000000U)
#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_TXN_EN_SHIFT (30U)
/*! ble_mst_txn_en - ble_mst_txn_en, Enable BLE master transaction latency monitor. When disabled; the maximum latency is reset to 0 */
#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_TXN_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_TXN_EN_SHIFT)) & BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_TXN_EN_MASK)

#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_ARB_EN_MASK (0x80000000U)
#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_ARB_EN_SHIFT (31U)
/*! ble_mst_arb_en - ble_mst_arb_en, Enable BLE master arbitration latency monitor. When disabled; the maximum latency is reset to 0 */
#define BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_ARB_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_ARB_EN_SHIFT)) & BLE2_REG_BLE_REG_AHB_LAT_BLE_MST_ARB_EN_MASK)
/*! @} */

/*! @name BLE_REG_DEBUG_RVSD - Debug reserved */
/*! @{ */

#define BLE2_REG_BLE_REG_DEBUG_RVSD_BRF_PU_OPT_EN_MASK (0x1U)
#define BLE2_REG_BLE_REG_DEBUG_RVSD_BRF_PU_OPT_EN_SHIFT (0U)
/*! brf_pu_opt_en - BRF powerup Optimization Enable, Enable BRF_PU optimization to save power in BRF-FRF cross connect mode of Firecrest A1 */
#define BLE2_REG_BLE_REG_DEBUG_RVSD_BRF_PU_OPT_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DEBUG_RVSD_BRF_PU_OPT_EN_SHIFT)) & BLE2_REG_BLE_REG_DEBUG_RVSD_BRF_PU_OPT_EN_MASK)

#define BLE2_REG_BLE_REG_DEBUG_RVSD_BLE_NAT_CLK_SLEEP_WR_EN_MASK (0x2U)
#define BLE2_REG_BLE_REG_DEBUG_RVSD_BLE_NAT_CLK_SLEEP_WR_EN_SHIFT (1U)
/*! ble_nat_clk_sleep_wr_en - BLE Native Clock Sleep write enable, Enable CPU write to BLE Native
 *    Clock in sleep domain. FW needs to set this bit before writing to BLE_REG_TMR_NATIVE_CLOCK
 *    register; and must clear this bit after the write is done.
 */
#define BLE2_REG_BLE_REG_DEBUG_RVSD_BLE_NAT_CLK_SLEEP_WR_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DEBUG_RVSD_BLE_NAT_CLK_SLEEP_WR_EN_SHIFT)) & BLE2_REG_BLE_REG_DEBUG_RVSD_BLE_NAT_CLK_SLEEP_WR_EN_MASK)

#define BLE2_REG_BLE_REG_DEBUG_RVSD_SWTPAST_ECO_DISABLE_MASK (0x4U)
#define BLE2_REG_BLE_REG_DEBUG_RVSD_SWTPAST_ECO_DISABLE_SHIFT (2U)
/*! swtpast_eco_disable - SWT past Intr ECO disable, Disable bit for SWT past intr WIPBTU-478 fix,
 *    0x0: WIPBTU-478 fix is enabled in Owl A1, 0x1: WIPBTU-478 fix is disabled; older logic preserved
 */
#define BLE2_REG_BLE_REG_DEBUG_RVSD_SWTPAST_ECO_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DEBUG_RVSD_SWTPAST_ECO_DISABLE_SHIFT)) & BLE2_REG_BLE_REG_DEBUG_RVSD_SWTPAST_ECO_DISABLE_MASK)

#define BLE2_REG_BLE_REG_DEBUG_RVSD_CCA_COEX_ECO_DIS_MASK (0x8U)
#define BLE2_REG_BLE_REG_DEBUG_RVSD_CCA_COEX_ECO_DIS_SHIFT (3U)
/*! cca_coex_eco_dis - CCA Coex ECO disable, Disable bit for CCA BTC+BLE coex TXPkt/TxAbort counters
 *    WIPBTU-546, 0x0: WIPBTU-546 fix is enabled in BB A1, 0x1: WIPBTU-546 fix is disabled; older
 *    logic preserved
 */
#define BLE2_REG_BLE_REG_DEBUG_RVSD_CCA_COEX_ECO_DIS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DEBUG_RVSD_CCA_COEX_ECO_DIS_SHIFT)) & BLE2_REG_BLE_REG_DEBUG_RVSD_CCA_COEX_ECO_DIS_MASK)

#define BLE2_REG_BLE_REG_DEBUG_RVSD_DEBUG_RVSD_MASK (0xFFFFFFF0U)
#define BLE2_REG_BLE_REG_DEBUG_RVSD_DEBUG_RVSD_SHIFT (4U)
/*! debug_rvsd - Debug Reserved, BLE-side reserved registers to be used for future ECO. */
#define BLE2_REG_BLE_REG_DEBUG_RVSD_DEBUG_RVSD(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_DEBUG_RVSD_DEBUG_RVSD_SHIFT)) & BLE2_REG_BLE_REG_DEBUG_RVSD_DEBUG_RVSD_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group BLE2_REG_Register_Masks */


/*!
 * @}
 */ /* end of group BLE2_REG_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_BLE2_REG_H_ */

